{
  "data": [
    {
      "jobTitle": "Web Developer",
      "company": "Daronet Australia",
      "companyLogo": null,
      "location": "Port Melbourne VIC",
      "salary": null,
      "time": "0",
      "rating": null,
      "apply": "http://www.daronet.com.au/careers/",
      "content": "<div><div>Leading Digital Agency Exciting New Projects using latest Technology<p></p>\n<ul><li>Port Melbourne location – short tram ride from CBD</li></ul>\n<ul><li>Comfortable spacious offices with parking</li></ul>\n<ul><li>Work and learn from a global agency offices in USA, Europe &amp;amp; Israel Due to growth, there is an opportunity for an experienced web developer/programmer who can work with Magento e-commerce platform &amp;amp; WordPress CMS. This individual must have the passion, initiative and a ‘can-do approach’, the ability to confidently liaise with clients where necessary and most importantly love what your doing! It is imperative that you will bring excellent user interface development skills including good knowledge of the latest web technologies including browser/device dependencies &amp;amp; best practices. You will be working in the most innovative and expert stage with people that understand the internet know how business and have over 11 years of experience. We encourage our staff to keep updated with the latest knowledge in the industry and believe in the development and growth of all of our staff members.</li></ul>\n<p>\nThe successful candidate must have;</p>\n<ul><li>Excellent knowledge of HTML5/CSS/Javascript/JQuery</li></ul>\n<ul><li>MUST have solid experience working with Magento e-commerce platform &amp;amp; WordPress CMS</li></ul>\n<ul><li>Experienced and general knowledge of MySQL &amp;amp; PHP</li></ul>\n<ul><li>Previous experience in a similar role or working with technologies listed above</li></ul>\n<ul><li>Experience on E-commerce platforms Please note, candidates with exposure to various Open Source web platforms and API’s will be preferred. If you want to start a career with one of Melbourne’s leading agencies in a role that will provide career development and a chance to be part of a great team – apply today.</li></ul></div></div>",
      "id": "p_dc9e79243a87c1a9",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front End Developer - Support",
      "company": "Shopify",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/95b02ae1bfdfa1874cb5124d661345b9",
      "location": "Remote",
      "salary": null,
      "time": "6",
      "rating": null,
      "apply": "https://jobs.lever.co/shopify/28e1e820-5db6-4d5b-a9cc-69a8c3702abe?lever-source=indeed",
      "content": "<div><div><div>Shopify Plus is making enterprise commerce simple. We give high growth, high volume merchants the scalability, reliability and flexibility they need. Shopify Plus is helping power commerce for companies like MVMT, Chubbies, Nestle, Kylie, and many more. We believe large merchants should love their commerce platform and we work hard each day to make that happen. We are a rocketship, and this is where you come in. Shopify is looking to grow the team responsible for building the next generation of commerce.<br>\n</div><div></div><br>\n<div>As a member of the Plus Support FED team, you'll work alongside some of the most talented people in the industry in developing custom solutions for Shopify’s enterprise-level clientele. While working closely with the Merchant Support and Plus Merchant Success teams, you will be helping merchants by answering questions, implementing customizations, and fixing issues.</div><div></div><br>\n<div>\nThis role will be remote in Australia.</div></div>\n<div><div><h3 class=\"jobSectionHeader\"><b>You can expect to:</b></h3><div><ul><li>\nWork with merchants in order to create a new feature or modify an existing feature of their theme</li><li>\nWork with merchants to debug and fix issues in their themes and Shopify Scripts</li><li>\nParticipate in code reviews and peer feedback sessions</li><li>\nCreate new Shopify Scripts or modify existing Shopify Scripts for Plus merchants</li><li>\nTeach merchants best practices when it comes to themes or Shopify Scripts</li><li>\nDevelop tools to help increase team efficiency</li><li>\nCommunicate with both the Plus Merchant Success team and Merchant Support teams in order to support Plus merchants</li><li>\nAct as subject matter experts in Front End Development inside Shopify's Merchant Support and Plus Merchant Success teams.</li><li>\nCollaborate closely with fellow team members to achieve team goals</li><li>\nParticipate in knowledge-sharing and mentoring initiatives both with the team and across Support teams at Shopify</li></ul></div></div></div><div></div><br>\n<div><div><h3 class=\"jobSectionHeader\"><b>\nWhat we’re looking for:</b></h3><div><ul><li>\nYou are detail oriented - your code is clean, organized and well thought-out</li><li>\nYou are comfortable working as part of a collaborative development team, including QAing other developers’ code and crafting easily-maintainable code</li><li>\nYou enjoy being a mentor and teaching others</li><li>\nYou care about performance and the fine details of a finished product</li><li>\nYou always want to improve how the team works, through standards, tools, etc</li><li>\nYou care about your craft and are involved in the development or design community</li><li>\nYou have experience working remotely and across multiple time zones</li></ul></div></div></div>\n<div><div><h3 class=\"jobSectionHeader\"><b>It’s great if you have:</b></h3><div><ul><li>\nAdvanced HTML, CSS, and JavaScript/jQuery knowledgeAdvanced web development fundamentals (the box model, HTML structures, flexbox, etc)</li><li>\nAn understanding of programming logic flow (if, else, while, case)</li><li>\nExperience with version control (eg. Git) and managing codebases with multiple developers</li><li>\nA working knowledge of Ruby and OOP programming principles</li><li>\nExperience using CSS preprocessors (SCSS, LESS) and/or build tools (Grunt, Gulp)</li><li>\nA working knowledge of the Liquid templating language</li><li>\nExperience with REST APIs, AJAX, and JSON</li><li>\nExperience working as part of a collaborative development team</li><li>\nFamiliarity with code performance practices</li><li>\nExperience building cross-browser scripts and responsive layouts</li><li>\nExperience communicating complex web development topics in an easily digestible manner</li></ul></div></div></div>\n<div><div>If you’re interested in helping us shape the future of commerce, click the “Apply now” button to submit your application. We know that applying to a new role takes a lot of work and we truly value your time, we look forward to reading your application.</div><div></div><br>\n<div>\nClosing date: Monday 04 May</div><div></div><br>\n<div><i>\nAt Shopify, we are committed to building and fostering an environment where our employees feel included, valued, and heard. Our belief is that a strong commitment to diversity and inclusion enables us to truly make commerce better for everyone. We strongly encourage applications from racialized people, people with disabilities, people from gender and sexually diverse communities and/or people with intersectional identities.</i></div></div></div>",
      "id": "p_6b1822d6a98cc33f",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Developer (ReactJS, NodeJS)",
      "company": "Six Degrees Executive",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/cb2fed2a64bd5f4fd5673091b11a7ddb",
      "location": "Melbourne VIC",
      "salary": null,
      "time": "0",
      "rating": null,
      "apply": "https://www.sixdegreesexecutive.com.au/job/full-stack-developer-reactjs-nodejs-1/?consultant=david.braham&aplitrak_id=32204&board_id=7067&utm_source=Volcanic",
      "content": "<div><div><p><b>About the company</b><br>\nOur client is an Australian cloud software company making waves on the global stage. With offices in the trendy inner suburbs of Melbourne, as well as an office in the US, they are market leaders within their field and have a strong customer base across the globe using their software.<br>\nThey are currently seeking a highly capable Full Stack Developer with strong technical skills in ReactJS and NodeJS.<br>\nGreat opportunity to join a passionate and nimble team dedicated to creating an amazing and reliable product for their customers.<br>\n<br>\n<b>About the role</b><br>\nReporting to the Development Director, this role works across the full website stack in a small Agile development team. Working within a talented team of developers, you will contribute to the architecture, development and delivery of innovative solutions for their clients. You will be responsible for maintaining and improving their core product as well as explore new technologies.<br>\n<br>\n<b>Skills and Experience</b><br>\nThe ideal candidate will be passionate about technology and always looking to improve the technical design. You will be an experienced, hands-on Full-Stack Developer who is highly collaborative and thrives in a high functioning, fast-paced Agile environment; and ready to take the next step in your career.<br>\n<br>\nYou will be experienced in full stack application development with strong skills in the following:</p><ul><li>\nReactJS</li><li>\nNodeJS</li><li>\nNoSQL DB (preferably MongoDB)</li><li>\nCSS</li></ul><p>\nYou will be a devoted learner, thrive in a team environment and always strive to write clean, easily reusable, and maintainable code.<br>\n<br>\nDesirable but not essential:</p><ul><li>\nGraphQL</li><li>\nExpress.js/Next.js</li><li>\nSASS (preferably SCSS)</li><li>\nAWS</li><li>\nAutomated JavaScript testing framework (e.g. jest, enzyme, react-testing-library, mocha, chai)</li><li>\nServerless application framework</li><li>\nA Bachelor or Computer Science or similar and any software development certifications highly regarded.</li></ul></div></div><p></p>",
      "id": "p_6f9dab08e0bfce4c",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Javascript Engineer",
      "company": "Hyper Anna",
      "companyLogo": null,
      "location": "Sydney NSW",
      "salary": null,
      "time": "1",
      "rating": null,
      "apply": "https://jobs.smartrecruiters.com/HyperAnna/743999711306933-senior-javascript-engineer",
      "content": "<p>Company Description<br>\n<br>\nnull</p>\n<br>\n<div>Job Description<br>\n<p><b>\nAbout Hyper Anna</b></p><p>\nWe’re a fast growth software start-up in the AI and data analytics space, and we’re on a mission to democratise data. Founded in 2016, we’ve built an AI powered data analytics platform that is transforming how businesses use data. Our software enables users to interact with their data in natural language, and proactively scans and presents the user with tailored insights within seconds. This means no need to wait on dashboards to be created or reports to be written, you are empowered to be curious about your business every day.</p><p>\nBehind our software is a growing team that is disrupting the analytics industry. People who love solving real world problems with smart ideas and smart technology. We're product builders, creative thinkers and we always go that extra step to delight our customers. Does that sound like you? Read on!</p><p><b>\nAbout the opportunity</b></p><p>\nWe’re looking for a Senior Javascript Developer to entrust with the interesting technical challenges involved in building and scaling SaaS software. You’ll be working in a cross functional team (engineers, designers and data scientists) and on a product that is disrupting the big data and analytics market. You’ll be a huge advocate for software best practices, mentor the team, and help us to get the most out of our stack as we design and deliver new features and functionality for our software.</p><p><b>\nA day in your life will include:</b></p><ul><li>\nBeing responsible for the development of high performance features</li><li>\nWorking in a cross functional team to solve technical challenges</li><li>\nBeing involved in software and service architecture discussions</li><li>\nDesigning and adopting strong engineering practices</li></ul><p><b>\nAbout you:</b></p><p>\nYou’re passionate, up to date on new technologies, and have strong software development fundamentals. You know when to obsess over details and when it’s time to ship. You love working in teams and helping others to grow with you. You’re someone who is laid-back, adaptable and wants to have an impact on the product you work on.</p><p>\n2020 will be a huge year for us and you have the opportunity to join us at the beginning of our hyper growth phase! This means you’ll have access to real career opportunities as we grow, receive a competitive salary and pre-IPO equity.</p><p>\nWe're building software for the data revolution, come and join us.</p></div>\n<br>\n<p>Qualifications<br>\n<br>\nnull<br>\n<br>\nAdditional Information<br>\n<br>\nnull</p>",
      "id": "p_747514cc53c283e3",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Laravel/PHP Developer",
      "company": "kmo design",
      "companyLogo": null,
      "location": "Brisbane QLD",
      "salary": null,
      "time": "8",
      "rating": null,
      "apply": "https://www.kmo.com.au/careers/php-developer-job-description/",
      "content": "<div><p>kmo is looking for an experienced Laravel/PHP developer to join our team and able to work across multiple projects simutaneously for customers from a variety of industries. While the candidate would preferably be located in Brisbane, remote candidates with the required skills may be considered.</p>\n<p>\nThe successful applicant will need to be professional, customer focused and able to work in a fast paced environment. Your problem solving skills will be tested in developing innovative solutions to meet our customer needs. You will need to be comfortable working across the full development stack.</p>\n<p><b>\nRequired Skills</b></p>\n<ul>\n<li>Minimum 5 years PHP development</li>\n<li>Bachelor degree or higher in Software Development related stream</li>\n<li>Experience with Laravel (Symfony 4 experience also considered)</li>\n<li>HTML5/CSS3</li>\n<li>JavaScript/jQuery</li>\n<li>React, Vue or Marionette experience highly considered</li>\n<li>SQL and MySQL database development skills</li>\n<li>Source Control Experience (Git)</li>\n</ul>\n<p><b>Desirable Skills</b></p>\n<ul>\n<li>Excellent written communication skills</li>\n<li>Familiarity implementing and consuming web services using XMl and JSON</li>\n<li>Ability to respond quickly to regular email if required</li></ul></div>",
      "id": "p_a3c8506801dc3cad",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Product Quality Officer",
      "company": "City of Gold Coast",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/707a8c16253613b032c03329cc348722",
      "location": "Nerang QLD",
      "salary": "$79,788 - $84,911 a year",
      "time": "3",
      "rating": "3.9",
      "apply": "https://erecruit1.mercury.com.au/GoldCoast/ViewPosition.aspx?Id=e5hslhKCxDo=&C=&E=&J=&P=&I=0&jbc=ere",
      "content": "<div><div><div><div>Reference number</div> <div>29236</div>\n</div><div></div><div>\n</div><br>\n<div><div>Employment status</div> <div>Full Time</div>\n</div><br>\n<div><div>Directorate</div> <div>Water and Waste</div>\n</div><br>\n<div><div>Location</div> <div>Nerang Office</div>\n</div><br>\n<div><div>Award - Classification</div> <div>Queensland Local Government Officers Award - Federal Level 6</div>\n</div><br>\n<div><div>Salary</div> <div>$79,787.86 to $84,910.99</div>\n</div><br>\n<div><div>Salary Details</div>\n</div><br>\n<div></div><div><div>Hours per week</div> <div>36.25</div>\n</div><br>\n<div><div>Days per fortnight</div> <div>9 DFN</div>\n</div><br>\n<div><div>Position summary</div>\n<div><p>To our valued community; As the novel coronavirus <b>COVID</b>-<b>19</b> continues to impact our community and daily lives, we want to assure you that we are monitoring developments very closely and taking all appropriate action. Keeping this in mind, please be aware that our recruitment process, while going ahead as usual, may take longer than average, and we ask that you remain patient during these prolonged periods.</p>\n<p>\nThe Gold Coast is an outstanding global city proudly looking towards its future. We are inspired by lifestyle and driven by opportunity.</p>\n<p>\nHere at City of Gold Coast, our commitment to a shared set of values shapes our decisions, actions and behaviours towards achieving the City Vision and our many city priorities.</p>\n<ul>\n<li><b>We aim high –</b> we are passionate about delivering the best for our city</li>\n<li><b>We add value –</b> we are innovative and make the most of every opportunity</li>\n<li><b>We work as a team –</b> our people are great individually, but unstoppable together</li>\n<li><b>We take responsibility –</b> we are committed to working safely, being trustworthy and owning our actions</li>\n</ul>\n<p><b>About the Position</b></p>\n<p>\nOur Product Quality team is responsible for the management of drinking water quality to ensure the continuous delivery of safe and reliable drinking water to the community of the Gold Coast. As a Product Quality Officer you will be responsible for monitoring and reporting water quality information to management and external stakeholders, initiating corrective actions and providing support in incident management, and providing exceptional customer service to City of Gold Coast residents. As well as assisting in the administration of the drinking water quality management plan and risk management system.</p>\n<p><b>\nAbout You</b></p>\n<ul>\n<li>Delivers high quality service to customers and understands and reacts responsively to customer expectations</li>\n<li>Demonstrated ability to recognise, investigate and solve problems of a scientific nature without supervision</li>\n<li>Seeks all relevant facts, thinks and analyses logically, prioritises problems and gathers information to identify causes and know when to engage with others</li>\n<li>A high level of interpersonal, negotiation, oral and written communication skills, including an ability to articulate complex issues and present in a clear and concise manner</li>\n<li>Ability to work productively in a team environment and foster good relationships with other team members</li>\n<li>Capacity to identify significant issues in a regulatory environment and recommend appropriate responses and solutions</li>\n<li>Ability to clearly and influentially articulate a vision, demonstrate the City of Gold Coast values and encourage and support others while building trusted relationships</li>\n</ul>\n<p><b>Key Deliverables of the position:</b></p>\n<ul>\n<li>Provide specialist water quality advice to external customers and stakeholders in line with internal policy, regulatory and legislative requirements</li>\n<li>Monitor, interpret and act upon routine and non-routine water quality information from the City of Gold Coast's drinking water distribution system</li>\n<li>Contribute to the administration and continual improvement of the drinking water quality management plan in accordance with all regulatory and legislative requirements.</li>\n<li>Assist with the development and implementation of policies, guidelines and work procedures, undertaking annual audits, reviews and presentations to management and key internal stakeholders</li>\n<li>Provide technical expertise for projects, analyse, interpret and communicate scientific data including statistical analysis relating to drinking and recycled water quality</li>\n<li>Develop and implement projects that relate to the continual improvement of the City of Gold Coast drinking and recycled water quality</li>\n</ul>\n<p><b>What can the City of Gold Coast offer you?</b></p>\n<p>\nWorking for the City of Gold Coast is both challenging and rewarding. You will enjoy:</p>\n<ul>\n<li>working within a culture that promotes a healthy work life balance with 9 day fortnights and flexible working arrangements;</li>\n<li>a friendly and supportive team where you will be recognised and rewarded;</li>\n<li>opportunities for professional development training and study assistance to enhance your career progression;</li>\n<li>a competitive remuneration plus up to 12% employer superannuation contribution and options to salary sacrifice;</li>\n<li>employee gyms based at the Nerang and Bundall offices;</li>\n<li>active Social Club with weekly raffles and various events throughout the year, for example weekend shopping trips, movie nights and more.</li>\n</ul>\n<p>To see what other benefits the City can offer check them out here: https://www.goldcoast.qld.gov.au/council/council-jobs-222.html</p>\n<p><b>\nThe Selection Process</b></p>\n<p>\nAs part of our selection process, you may be required to undertake a one way video interview via SparkHire, and a face to face interview; you may also be required to undertake police checks, employment history checks, qualification checks and drug and alcohol testing in accordance with Australian Standards and Council's procedures.</p>\n<p>\nPlease note applications for all of our vacancies close at 10.30pm on the listed closing date.</p>\n<p>\nYou can now stay up to date with all of our advertised vacancies by joining our recruitment Facebook page: https://www.facebook.com/COGCRecruitment</p><br>\n</div></div><br>\n<div><div>Screening questions</div> <div>Essential: Do you have a Bachelor Degree of Science or the equivalent knowledge? (If you have the Bachelor Degree, please upload a copy under 'Identification Document' as part of your application).<br>\nEssential: Please describe your motivation for applying for this role and the key contributions that you think you can bring to the position.\n<br>\nEssential: Please explain your understanding of managing drinking water quality from a scientific, practical and regulatory perspective.<br>\nEssential: Please describe a scenario where you were required to recognise, investigate and solve a problem of a scientific nature without supervision.\n<br>\nEssential: Please explain your ability to effectively communicate across a range of audiences, and describe how you would manage a difficult conversation with a frustrated customer.\n<br>\nEssential: Do you have a Class C Drivers Licence?<br>\nDesirable: Do you have a General Construction Induction Card (White Card)?</div>\n</div><br>\n<div><div>Contact person</div> <div>Kris Pardoe-Matthews</div>\n</div><br>\n<div><div>Contact number</div> <div>0755828186</div>\n</div><br>\n<div><div>Alternate contact person</div> <div>Jon Messina</div>\n</div><br>\n<div><div>Alternate contact number</div> <div>0755828861</div>\n</div><br>\n<div><div>Closing date</div> <div>05/05/2020</div></div></div></div><div></div>",
      "id": "p_16930c68930050da",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "QA Analyst",
      "company": "AKQA",
      "companyLogo": null,
      "location": "Melbourne VIC",
      "salary": null,
      "time": "10",
      "rating": "3.5",
      "apply": "https://boards.greenhouse.io/akqa/jobs/2152479?gh_src=99f6b0ca1us",
      "content": "At AKQA, we have a culture of excellence in Software Development and Marketing Technology and pride ourselves on our track record of helping our clients leverage enterprise platform features. Our Quality Assurance team ensures the quality and optimal release of all engineering products to help clients realise only the best iteration of each solution.\n<br><br>\nAs a QA Analyst, you will work closely with Technical Project Managers and Engineering team members to guarantee quality of delivery and ensure all digital agency outputs are aligned with key project success metrics.\n<br><br>\nLocated in Melbourne, as part of AKQA, you'll work in a meritocratic culture, surrounded by some of the brightest minds in their fields. You'll also have the opportunity to learn and grow within a creative and technically advanced team, and have access to ongoing personal and professional development. At AKQA, we are committed to your both you career growth and your work/life balance.\n<br><br>\nROLE REQUIREMENTS\n<br><br>\n<ul>\n<li>Execute various manual and automation testing activities.</li>\n<li>Work within project squad team to deliver projects at highest quality and within budget.</li>\n<li>Analyse complex business and data requirements to devise effective test cases.</li>\n<li>Devise effective test plan for complex projects.</li>\n<li>Create defects into JIRA management system and ensure they are resolved within required timeline.</li>\n<li>Diagnose and troubleshoot defects to pinpoint root cause of a defect.</li>\n<li>Ensures the quality of work being produced is off the highest standard.</li>\n<li>Continuous improvement of testing practices for continued efficiencies and high standard for all work.</li>\n</ul>\nQUALIFICATIONS AND CHARACTERISTICS\n<br><br>\n<ul>\n<li>Extensive experience in functional testing, integration testing, and cross-browser testing for web applications.</li>\n<li>Excellent troubleshooting skills to uncover root cause of application defects.</li>\n<li>Experience working in an Agile environment.</li>\n<li>Ability to create test plan and test case documentation.</li>\n<li>Ability to write automated test script using tools such as Selenium WebDriver or Cypress.</li>\n<li>Ability to execute performance testing scripts using JMeter (or other performance testing tools).</li>\n<li>Knowledge of web accessibility and inclusivity is advantageous.</li>\n<li>Strong technical knowledge in web technologies.</li>\n<li>Programming skills (preferably C#, Java, or Javascript).</li>\n<li>Knowledge of CMS-based applications such as Sitecore, Adobe AEM, Contentful is advantageous.</li>\n<li>Tertiary qualification in Computer Sciences or similar preferred.</li>\n<li>Excellent time management skills, enabling you to work on multiple projects concurrently.</li>\n<li>Strong verbal and written communication skills, enabling you to clearly articulate application defects.</li>\n<li>Sharp attention to detail and a drive for perfection.</li>\n</ul>\nAKQA is an Equal Opportunities Employer, we believe that diversity is vital to AKQA's ability to provide our clients with the best recommendations and are committed to fostering a varied and inclusive work environment. Your race, colour, ancestry, religion, gender, gender identity, national origin, sexual orientation, age, marital status, disability or veteran status have no bearing on our hiring decisions. If you have a disability or special need that requires accommodation, please let us know.",
      "id": "p_2f747fcb16b48a17",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior React / Node Developer",
      "company": "Opus Recruitment Solutions",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/2afd4b89cde8c4ca35d5f0d1fc752d60",
      "location": "Melbourne VIC",
      "salary": "$120,000 - $150,000 a year",
      "time": "5",
      "rating": null,
      "apply": "https://www.opusrecruitmentsolutions.com/search-jobs/34904845-senior-react-node-developer-job-australia-melbourne?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div>Senior Full Stack Developer\n<br>\nMelbourne\n<br>\n120k – 150k salary +Super (Experience depending)\n<br>\n<ul><li>Permanent Role within a small Agile team</li><li>\nFlexible hours, product focussed, E-Commerce company</li><li>\nA chance to work with the latest technology and have a huge impact on the business</li></ul>\nThe company\n<br>\nOur client is an industry leader. Their attitude is always to bring in the best people in to drive their business forward. They believe in maximising impact through exceptional product development &amp; marketing. They've made a focus on bringing their digital footprint and E-Comm / logistics platforms up to speed to help their astronomical growth. Within the company you will be joining a hands on team, focussed on a culture of professional success, and personal satisfaction. There is a strong belief in taking pride in your work, and being given the opportunity to develop and progress to fulfil your potential.\n<br>\n<b>The Role\n</b><br>\nYou will be collaborating with the CTO in an agile, cross-functional team, mentoring the junior devs, and maintaining a culture that values effective development and tech implementation.\n<br>\n<b>Responsibilities</b>\n<br>\nImplementing the latest tech updates for the website.\n<br>\nDeveloping and releasing new features on both logisitcs &amp; E-Commerce\n<br>\nWorking with Frontend developers to ensure consistent, positive customer experience. As well as building clean functional back end APIs\n<br>\nAdding value to the team through your experience and creativity.\n<br>\n<br>\nAs an ideal candidate you will have:\n<br>\n5 years + Fullstack experience\n<br>\nIntimate knowledge of Javascript Frameworks\n<br>\n2+ years with React\n<br>\n2+ years with Node.js\n<br>\nExperience in start-up environments\n<br>\nExperience with AWS\n<br>\nBonus points for TypeScript &amp; E-Commerce experience.</div>",
      "id": "p_6c0278fd6f7598ce",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "General Hand",
      "company": "Vanderlande Industries",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/92754035eb6addfbd8e9a2bd89fe01a9",
      "location": "Melbourne VIC",
      "salary": null,
      "time": "12",
      "rating": null,
      "apply": "https://vanderlande.wd3.myworkdayjobs.com/en-US/careers/job/Melbourne/General-Hand_JR10318-1?mode=job&iis=Indeed&iisn=Indeed.com",
      "content": "<div><h3 class=\"jobSectionHeader\"><b>Job Title\n</b></h3>General Hand\n<p></p><h3 class=\"jobSectionHeader\"><b>Job Description\n</b></h3><div><p><b>Your Position\n</b></p><p>Based in the South-Eastern suburbs of Melbourne, you will work in one of the biggest automated warehousing solutions that has ever been built by Vanderlande.\n</p><p></p><p>Working on a shift rotation, you will be responsible for responding to all system callouts, errors notifications, blockages, alarms and warnings occurring on the system. You will be trained on how to solve simple/low risk electro-mechanical issues on the system. You may also be responsible for any and all technical related cleaning activities occurring on the system. In addition, you will be trained to exchange several types of consumables (e.g. foil, labels and cartons). You will effectively and clearly communicate all events/activities occurring on the system to the maintenance teams and maintain the professionalism expected by a Vanderlande employee.\n</p><p></p><p>Reporting directly to your Shift Leader, you will support the maintenance team by doing any ad hoc duties required by the Site Manager or Shift Leader.\n</p><p></p><p><b>Tasks and duties include, but not limited to:\n</b></p><ul><li>Effectively respond and react to any operational callouts, error notifications, blockages, alarms and warnings as instructed.\n</li><li>Exchange / refill consumables (e.g. foil, labels, cartons).\n</li><li>Clean parts of the system as part of maintenance or when technical related spillages occur.\n</li><li>Effectively communicate all system events clearly to relevant teams in order to minimize customer operations.\n</li><li>Monitoring Vanderlande equipment and advising client/customer staff on proper machine process and operation.\n</li><li>Effectively clear any system issues or blockages where required.\n</li><li>Keep the workplace, system and floor space clean and tidy and observe OH&amp;S procedures at all times.\n</li><li>Assist maintenance staff with general maintenance duties where/when needed.\n</li><li>Perform low risk tasks such as repair pneumatic leaks, replace filters and sensor alignments/replacements.\n</li><li>Be able to execute instructions as directed and work independently or as part of a team.\n</li><li>Ensure that all activities, breakdowns and incidents are clearly documented.\n</li><li>Use personal protective equipment (PPE) when working at all times.\n</li><li>Ensure that all activities are carried out in a safe manner and comply with company policies and procedures.\n</li><li>Required to undertake any other reasonable duty as instructed by your Manager or other Maintenance Team Members.\n</li></ul><p></p><p><b>The ideal candidate:\n</b></p><ul><li>Highly motivated individual with ability to learn quickly.\n</li><li>Have basic problem solving abilities.\n</li><li>Able to work in a team environment.\n</li><li>Good English communication skills, both oral and written.\n</li><li>Experience within a warehouse environment preferred, not essential (not a heavy machinery environment).\n</li><li>Punctual, dependable and well presented.\n</li><li>Mechanical or electrical aptitude.\n</li><li>Current Forklift license is highly beneficial, not essential.\n</li><li>Physically fit.\n</li><li>Available for an immediate start if necessary.\n</li><li>Hold an Australian or New Zealand citizenship or have an Australian Permanent Residency with unrestricted rights to work in Australia.\n</li></ul><p></p><p>You will be required to work on a 4 on / 4 off rotating roster with a work schedule of two 12 hour day shifts, two 12 hour night shifts and four consecutive days off.\n</p><p></p><p>A competitive remuneration package will be offered to someone who is a team player with a positive, energetic attitude and work ethic as well as the ability to think outside the square.\n</p><p>In a world of technology, Vanderlande believes in people – its employees make the difference in everything the company does. To apply for this unique and exciting opportunity, submit your cover letter and resume.\n</p><p></p><p><b>ID checks will be performed to verify work entitlements in Australia.</b></p></div></div>",
      "id": "p_a3c5a2748fc0eec0",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior React Developer",
      "company": "4mation Technologies",
      "companyLogo": null,
      "location": "Sydney NSW",
      "salary": null,
      "time": "9",
      "rating": null,
      "apply": "https://careers.4mation.com.au/current-opportunities/?ja-job=3562533",
      "content": "<div><p>About 4mation<br>\n</p><br>\n4mation is a full service custom web and software agency offering end to end project delivery by industry experts. We are proud to say we’re among Australia’s best places to work- ranking reliably in the top 10 in Australia. Our team enjoy an awesome environment and unique benefits.<br>\n<br>\nWhat does the average day look like for you?<br>\nYou'd be embedded with one of our best clients- We’re talking about one of the most reputable and well-known companies in Australia, with one of the swankiest offices around.<br>\n<br>\nYou’ll be introduced as a senior resource in a team that develops their core product, which you probably use every single day. Ideally, you’ll come from a commercial environment and have experience working in larger software development teams. You’ll be our resident react expert, and we’ll rely on you for the coaching, mentoring and development of the team you’re embedded in.<br>\n<br>\nEvery day you’ll go to work with the best engineers in Australia, you’ll learn a lot, fast. You’ll get all the training and development you need to be successful, and if your successful in the role, career progression is practically guaranteed.<br>\n<br>\n<p>As a 4mation React Developer, you will:</p><br>\n<ul><li>Write amazing user interfaces using JavaScript and React JS technologies</li>\n<li>Liase with our head of contracts and consultancy to deliver the best possible value to our Clients.</li>\n<li>Build clean re-usable components with a focus on scalability</li>\n<li>Have a positive attitude and willingness to learn</li><br>\n</ul><br>\n<p>Skills and experience</p><br>\n<ul><li>Significant front-end development experience using React JS &amp; JavaScript</li>\n<li>Solid experience in agile software development practices</li>\n<li>Understanding of full-stack web applications</li>\n<li>Ability to create and work with APIs</li>\n<li>Experience in integrating with third-party systems</li>\n<li>Knowledge of and experience with client-side web development frameworks - ideally the React ecosystem (including Redux and React-Router)</li>\n<li>Experience managing work through task management systems, ideally Jira.</li>\n<li>Some experience with Microservice architecture is desirable</li>\n<li>Experience with concepts such as CI/CD and DevOps</li>\n<li>Experience with source control, ideally Git</li>\n<li>Experience with Design System development and management</li><br>\n</ul><br>\n<p>Benefits and culture</p><br>\nYou’ll be working for a company that puts its staff first- embedded in one of the big 3 software development companies in Sydney. You’re essentially doubling down on awesome benefits this way. As for our benefits- check them out over here- https://careers.4mation.com.au/why-4mation/#our-office-perks<br>\n<br>\nAs for the rest of them- well, Let’s save the details for the interview but I can promise you won’t be disappointed with them all.</div>",
      "id": "p_6565cb531ae7a851",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Front End Web Developer",
      "company": "icare NSW",
      "companyLogo": null,
      "location": "Sydney Central Business District NSW",
      "salary": "$128,089 a year",
      "time": "8",
      "rating": null,
      "apply": "https://careers.icare.nsw.gov.au/cw/en/job/494215/senior-front-end-web-developer",
      "content": "<div><p><b>icare is currently seeking an experienced Senior Front End Web Developer with a commercial mindset and a passion for social impact to join the icare team!\n</b></p><ul><li>Contribute to icare’s public website and customer portals and lead design system components.</li>\n<li>Permanent opportunity</li>\n<li>Salary from $128,089 + super</li>\n</ul>\n<p>We’re looking for someone to Write, translate, and code software programs and applications according to specifications and by using the best software development practices to enhance the presence of icare. Partner with cross functional teams to understand requirements, implementation specifications and maintain applications.</p>\n<p>\nYou’ll be working with a diverse mix of creative, curious and smart people who really care about making a difference for people and the NSW community. You will have a mind for getting things done and a heart for people and you will set the bar high through the quality of the work you do and the people-oriented decisions you make.</p>\n<p>\nYou’ll bring your experience designing and building production level web applications, also Expert-level HTML, CSS, JavaScript, REST and JSON skills utilising best practices of performance, security, accessibility, and usability. Understanding of front end architecture, building single web page applications and Experience with applying unit testing frameworks e.g. Mocha, Chai etc.</p>\n<p>\nIt’s an exciting environment where no two days are the same. But on a typical day you might find yourself:</p>\n<ul>\n<li>Thought leader to the organisation in embedding human centred design.</li>\n<li>Anticipate and assess changes which impact the business and exercise judgement in the absence of precedent and make decisions with significant impact.</li>\n<li>Has autonomy in negotiating and determining matters related to their area of responsibility and is accountable for advice and guidance given.</li>\n<li>Determines how to achieve objectives including deciding methods and deploying resources.</li>\n<li>Addresses problems in the work environment, devises action plans and advocates new approaches.</li>\n<li>Ensures decisions are based on evidence and makes effective judgments under pressure.</li>\n<li>Makes decisions within the level of financial and administrative delegation assigned to the role and within corporate / government / legislative protocols.</li>\n</ul>\n<p>We’re a new kind of organisation, one that’s as supportive and socially conscious as it is agile and explorative. Our DNA of commercial mind and social heart captures who we are at our core.</p>\n<p>\nIf you think you’re the right person for this role, send us your resume (up to 5 pages). Don’t delay as we’re assessing applications as they are received. We’d love to hear how your capabilities, achievements and experience set you apart.</p>\n<p>\nWe know our strength comes from the diversity of our people and so we want people with different experiences and backgrounds to apply. We recognise the importance of balance and flexibility and understand that it’s not a one size fits all approach, so we’d be happy to talk about and consider your specific needs.</p>\n<p>\nPlease note that you must be an Australian citizen or a permanent resident of Australia or a New Zealand citizen with a current New Zealand passport to apply for this role.</p>\n<ul>\n<li>icare is the brand of Insurance &amp; Care NSW</li>\n<li>For more information about icare visit our website</li>\n<li>icare operates a direct sourcing model so no agency introductions will be accepted</li></ul></div>",
      "id": "p_25ce05ed1676a69e",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Developer",
      "company": "DEK Technologies",
      "companyLogo": null,
      "location": "Melbourne VIC",
      "salary": null,
      "time": "9",
      "rating": null,
      "apply": "https://www.dektech.com.au/job/full-stack-developer/",
      "content": "<p></p><div><p>DEK Technologies is a software and hardware engineering services company with offices in 5 countries and 500+ employees worldwide.</p>\n<p>\nWe place high value on people and the individual competence they contribute. That is why people enjoy working with us. They enjoy the team camaraderie, flexibility, opportunities for travel, and feeling part of the company’s success.</p>\n<p>\nWe’re a fast-paced and expanding company looking for an experienced Full Stack Developer to lead and lift the team’s technical capability for a software solution based on the google app engine.</p>\n<p>\nYou’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from concept to deployment.</p>\n<p><b>\nRequired skills</b></p>\n<ul>\n<li>5+ years’ experience as a Full Stack Developer or similar role</li>\n<li>Experience developing desktop and mobile applications</li>\n<li>Experience with Google App Engine</li>\n<li>Familiarity with common stacks</li>\n<li>Must have experience with React JS for Front End Technology</li>\n<li>Must have experience with Python for Back End Technology</li>\n<li>Degree in Computer Science, Statistics or relevant field</li>\n</ul>\n<p><b>Desired skills</b></p>\n<ul>\n<li>Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)</li>\n<li>Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)</li>\n<li>Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design</li>\n</ul>\n<p><b>Interpersonal skills</b></p>\n<ul>\n<li>Excellent communication and teamwork skills</li>\n<li>Great attention to detail</li>\n<li>Organizational skills</li>\n<li>An analytical mind</li>\n</ul>\n<p>If you hold a relevant working visa, are a team player, love to have fun while kicking some serious goals, are constantly excited about learning new technologies and creating solutions that amaze our customers; then we want to hear from you!</p>\n<p><b><i>\nPlease Note: We are only interested in applications from individuals and are not interested in any speculative calls or submissions from Recruitment Agencies.</i></b></p></div>",
      "id": "p_d517c2807a8d8e0d",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior React Developer",
      "company": "4mation Technologies",
      "companyLogo": null,
      "location": "Sydney NSW",
      "salary": null,
      "time": "9",
      "rating": null,
      "apply": "https://careers.4mation.com.au/current-opportunities/?ja-job=3562533",
      "content": "<div><p>About 4mation<br>\n</p><br>\n4mation is a full service custom web and software agency offering end to end project delivery by industry experts. We are proud to say we’re among Australia’s best places to work- ranking reliably in the top 10 in Australia. Our team enjoy an awesome environment and unique benefits.<br>\n<br>\nWhat does the average day look like for you?<br>\nYou'd be embedded with one of our best clients- We’re talking about one of the most reputable and well-known companies in Australia, with one of the swankiest offices around.<br>\n<br>\nYou’ll be introduced as a senior resource in a team that develops their core product, which you probably use every single day. Ideally, you’ll come from a commercial environment and have experience working in larger software development teams. You’ll be our resident react expert, and we’ll rely on you for the coaching, mentoring and development of the team you’re embedded in.<br>\n<br>\nEvery day you’ll go to work with the best engineers in Australia, you’ll learn a lot, fast. You’ll get all the training and development you need to be successful, and if your successful in the role, career progression is practically guaranteed.<br>\n<br>\n<p>As a 4mation React Developer, you will:</p><br>\n<ul><li>Write amazing user interfaces using JavaScript and React JS technologies</li>\n<li>Liase with our head of contracts and consultancy to deliver the best possible value to our Clients.</li>\n<li>Build clean re-usable components with a focus on scalability</li>\n<li>Have a positive attitude and willingness to learn</li><br>\n</ul><br>\n<p>Skills and experience</p><br>\n<ul><li>Significant front-end development experience using React JS &amp; JavaScript</li>\n<li>Solid experience in agile software development practices</li>\n<li>Understanding of full-stack web applications</li>\n<li>Ability to create and work with APIs</li>\n<li>Experience in integrating with third-party systems</li>\n<li>Knowledge of and experience with client-side web development frameworks - ideally the React ecosystem (including Redux and React-Router)</li>\n<li>Experience managing work through task management systems, ideally Jira.</li>\n<li>Some experience with Microservice architecture is desirable</li>\n<li>Experience with concepts such as CI/CD and DevOps</li>\n<li>Experience with source control, ideally Git</li>\n<li>Experience with Design System development and management</li><br>\n</ul><br>\n<p>Benefits and culture</p><br>\nYou’ll be working for a company that puts its staff first- embedded in one of the big 3 software development companies in Sydney. You’re essentially doubling down on awesome benefits this way. As for our benefits- check them out over here- https://careers.4mation.com.au/why-4mation/#our-office-perks<br>\n<br>\nAs for the rest of them- well, Let’s save the details for the interview but I can promise you won’t be disappointed with them all.</div>",
      "id": "p_6565cb531ae7a851",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Analyst Programmer",
      "company": "FinXL",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/8e390e5d957907b772b9183d164d1823",
      "location": "Sydney NSW",
      "salary": null,
      "time": "7",
      "rating": null,
      "apply": "https://www.finxl.com.au/job/analyst-programmer-1/",
      "content": "<b>Location:</b><br>\nSydney\n<br><br>\n<b>Job Type:</b><br>\nPermanent\n<br><br>\n<b>Specialisation:</b><br>\nCommercial\n<br><br>\n<b>Reference:</b><br>\n(JG)49020_1\n<br><br>\n<ul>\n<li>Sydney, CBD based</li>\n<li>Large, high profile organisation</li>\n</ul>\nThe role\n<br><br>\nFinXL IT Professional Services- an established, innovative Australian company are looking for an Analyst Programmer.\n<br><br>\nWe are open to candidates with various technologies including but not limited to IOS, Android, Java, React.\n<br><br>\n<b>Who you are:</b><br>\n<b>You will have the following skills/experience:</b><br>\n<ul>\n<li>Extensive experience as an Analyst Programmer</li>\n<li>Excellent communication skills</li>\n</ul>\nWhat’s on offer\n<br><br>\nThis is a permanent role with generous remuneration.\n<br><br>\nWhat’s next\n<br><br>\nIf you would like to be considered, please send applications to jackieg@finxl.com.au or apply on line. Please note that due to the number of responses only successful applicants will be contacted.\n<br><br>\nWho we are\n<br><br>\nFinXL IT Professional Services is an established, innovative Australian company, providing technology enabled business solutions and consulting services across a number of industries. These include; Government, Telecommunications, Commercial and Finance. We currently have more than 1200 consultants assisting our clients across Australia and are continuing to grow at a rapid pace. Through the delivery of services and implementation of new systems, processes and technology, we assist our clients to gain competitive advantage and reach new heights.",
      "id": "p_4259e2be93f90229",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer - PHP or Laravel",
      "company": "AustCorp Executive",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9efd5e8c0b131ffd63e55e1415c32c67",
      "location": "Sydney NSW",
      "salary": null,
      "time": "0",
      "rating": null,
      "apply": "https://www.austcorpexecutive.com.au/i-t-and-t-jobs/software-developer-php-or-laravel/2997492?utm_source=indeed&utm_medium=organic&utm_campaign=indeed",
      "content": "<b>The company:</b><br>\nA specialist E-Learning platform that allows connectivity and the opportunity to lean and enhance your academic and general social environment. Looking to hire a Lead Developer to be the senior technical employee of the business and potentially move into a CIO role through strong performance.\n<br><br>\n<b>The Role:</b><br>\nWorking as the Lead Developer you will be responsible writing and maintaining code in PHP using Laravel framework. You will work closely with the business owners to help identify client needs and build technical solutions accordingly. You will also help to guide the technical roadmap for the business.\n<br><br>\n<b>Requirements for the role:</b><br>\nExtensive experience with PHP and Laravel framework\n<br>Comfortable with AWS infrastructure\n<br>Experience with Node JS\n<br>Leading and growing software teams is a good to have\n<br>Test driven development\n<br>Experience with Redis and MySQL\n<br><br>\nThere is a clear path to move upwards from this role into a CTO role for the business. The company is also willing to offer equity as part of the package so a great opportunity all round",
      "id": "p_cc3be37f805c74e3",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Developer",
      "company": "Chandler Macleod",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/617777d595cf9ccf7e4c38d5cd474371",
      "location": "Victoria",
      "salary": null,
      "time": "10",
      "rating": "3.6",
      "apply": "https://www.chandlermacleod.com/job/full-stack-developer-2?utm_source=indeed&utm_medium=organic&utm_campaign=indeed",
      "content": "<div><p>Our client a well known Federal Government department is seeking an experienced Full Stack Developer to join their team up until the end of October 2020 plus extesions.\n</p><p></p><p><b>About the role:</b></p><p>\nFull Stack Developer who will undertake technical landscape design, installation, configuration, deployment, technical security and operation of ICT components and databases. The role works under the limited direction of senior technical staff. They exercise both initiative and judgement in the interpretation of policy and in the application of practices and procedures. Decision making is substantially dependent on judgement, skills and knowledge. The role manages and organises your own work in the context of competing priorities within the constraints of the delivery vehicle you are engaged with at the time.</p><p><br>\n<br>\n<b>Experience Required:</b><br>\n</p><ul><li>Experience with Government Agencies highly regarded</li><li>\nPublic/Private cloud technologies, patterns and techniques</li><li>\nOpen source development paradigms</li><li>\nAgile development practices</li><li>\nSpecific technologies including:<br>\no NodeJS<br>\no Kafka<br>\no Kong<br>\no OpenShift<br>\no MongoDB</li></ul></div>",
      "id": "p_bd6dbfe135b77b3c",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Web Application Developer",
      "company": "Clicks IT Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9cf7aca3c385c5dbc37794db3e069c87",
      "location": "Canberra ACT",
      "salary": null,
      "time": "4",
      "rating": "5.0",
      "apply": "https://clicks.com.au/jobs/contract-it-jobs/in-act/bbbh64871-web-application-developer/",
      "content": "Clicks is a specialist IT recruitment company with offices in Canberra, Melbourne, Sydney and Brisbane. A home-grown Australian business with global capability, Clicks has been providing contract and permanent recruitment services to Australia's leading government and blue-chip organisations since 1990.\n<br>Our Government client is seeking a number of Web Application Developers for contract roles until June 2020. The role is responsible for the design and develop of software application integrating commercial off the shelf software and open source applications.\n<br><br>\n<b>In this role, the successful candidates will be expected to:</b><br>\nAnalyse existing business and system processes to inform a web based application solution that integrates with licensed digitisation software\n<br>Assist with testing prototype with system administrators and business users\n<br>Leverage existing open source tools in redevelopment\n<br><br>\n<b>A working knowledge will be required for the following:</b><br>\nASP.NET web applications including MVC\n<br>RESTful services\n<br>Web technologies, HTML, CSS, JavaScript frameworks\n<br>Microsoft TFS\n<br>Microsoft SQL databases\n<br><br>\nFor further information please contact Sean Tolley at Clicks IT Recruitment on 02 6202 7755.\n<br><br>\nType\n<br>Contract\n<br><br>\nCategory\n<br>Project / Program / PMO support\n<br><br>\nReference ID\n<br>BBBH64871",
      "id": "p_b77eee98fb776a95",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front End Developer | NSW Government",
      "company": "The Recruitment Company",
      "companyLogo": null,
      "location": "Sydney NSW",
      "salary": "$700 a day",
      "time": "2",
      "rating": null,
      "apply": "https://www.therecruitmentcompany.com/jobs/439192_1-front-end-developer-nsw-government/",
      "content": "<div><ul><li>Parramatta location close to train station</li>\n<li>$700 per day + super</li>\n<li>6 month initial contract with possible extension</li>\n</ul>\n<p><b>About the role:</b></p>\n<p>\nThe Applications Developer will deliver innovative digital solutions for high quality teaching and learning. The Applications Developer will develop user-centric web applications with front-end frameworks like Angular JS or Angular 7.</p>\n<p>\nThis role requires experience and expertise in UX/UI design, HTML5 and CSS3, JavaScript, proficiency in designing responsive solutions web apps and extensive understanding of UX processes and Agile development.</p>\n<p><b>\nDetailed requirements:</b></p>\n<ul>\n<li>4-5+ years professional experience with expertise in HTML5 and CSS3, JavaScript, UI/UX design.</li>\n<li>Develop web applications with front-end frameworks like Angular JS or Angular 7</li>\n<li>Proficiency in designing responsive solutions for web, app.</li>\n<li>Experience designing for web platforms including extensive understanding of UX processes and methodologies and the interplay between business requirements, branding, visual design and the technology behind website and app development</li>\n<li>Experience of back-end technologies like Java and databases</li>\n<li>Experience in responsive design principles and evolving technologies</li>\n<li>Designing and developing cross browser and cross device compatible design</li>\n<li>Experience in front end frameworks (AngularJS, Angular, ReactJS, NodeJS, Bootstrap, etc.)</li>\n<li>Strong knowledge of jQuery and JavaScript</li>\n<li>Strong knowledge of web accessibility and best practices</li>\n</ul>\n<p>Please apply now for immediate consideration, role to start ASAP pending background checks (police check and working with childrens check).</p>\n<p>\nFor further questions only please call Danielle on 02 8346 6702.</p></div>",
      "id": "p_e9857bf5f93214ec",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Developer",
      "company": "Class Super",
      "companyLogo": null,
      "location": "Gold Coast QLD",
      "salary": null,
      "time": "10",
      "rating": null,
      "apply": "https://jobs.lever.co/class/200e7d11-084a-48c9-93e4-3e473f758ec3",
      "content": "<div><div><div><b>WHO WE ARE AND WHAT WE DO?</b></div><div></div><br>\n<div>\nClass is an award winning SMSF Administration and Wealth Accounting Software ASX Listed business. Our purpose is to make processing and data connection painless. We reimagine solutions through the smart application of technology and our vision is to ensure a more simple, automated world for our customers so they will love it!</div><div></div><br>\n<div>\nAre you looking for your next challenge with a growing technology business where \"Automation, Simplicity and Connectivity\" is in our DNA? Awesome offices overlooking the city skyline, excellent culture where innovation is our breathing ground and collaboration where we do it with heart!</div><div></div><br>\n<div>\nNowInfinity are a leading platform in the Fintech space. We resolve pain points in financial businesses through adopting better technology solutions. An exciting acquisition was formed in February this year where Class Limited acquired NowInfinity. As a result of this new acquisition NowInfinity is looking to expand their Engineering team. This role will report into the Head of Engineering.</div></div><div></div><br>\n<div><div><h3 class=\"jobSectionHeader\"><b>\nWhat will you do?</b></h3><div><ul><li>\nBack-end and front-end development, ranging from minor product updates to entirely new features and products</li><li>\nDiagnosing and fixing bugs and performance issues</li><li>\nWriting unit tests, and manually testing software</li><li>\nReviewing code written by other development team members</li><li>\nProviding time and feasibility estimates for new features</li><li>\nDocumenting solutions, technical processes, architecture and conventions</li><li>\nEngaging with design and product management to provide technical input on product updates that are being considered</li><li>\nHelping the customer support team where needed for technical support enquiries and customer bug reports</li><li>\nProviding assistance where needed to extract and analyse product usage data</li><li>\nMeeting with technology and product managers to determine application and website requirements.</li><li>\nParticipate in requirements analysis</li></ul></div></div></div>\n<div><div><h3 class=\"jobSectionHeader\"><b>Experience Required:</b></h3><div><ul><li>\nBachelor’s degree in Computer Science or Information Technology (Desired)</li><li>\nSolid software design and development with Microsoft technologies, .net</li><li>\nKnowledge of .NET languages including C#</li><li>\nSignificant experience with database development using Microsoft SQL Server</li><li>\nExperience using WebAPI/ Swagger; Typescript; git skills; open XML; TeamCity</li><li>\nProficient with front-end development languages including JavaScript, TypeScript, HTML5, and CSS.</li><li>\nCommercial Dynamics CRM experience</li><li>\nGreat interpersonal and communication skills</li><li>\nHighly organized, motivated and self-directed</li><li>\nCapable of taking ownership of projects and domains</li><li>\nUnderstanding of Agile methodologies</li><li>\nExperience working with offshore development teams</li></ul></div></div></div>\n<div><div>If you are looking for your next opportunity to work for a growing technology company where we thrive on \"better together, doing it with heart, re-imagination and trust\", please apply button now.</div><div></div><br>\n<div><b>\nWHY WORK FOR US?</b></div><div></div><br>\n<div>\nClass is heavily focused on technology innovation, attracting the best talent and delivering on our Reimagination strategy. We are in an exciting growth phase and this opportunity will truly have an impact to make a difference and bring us to being a world class business!</div></div></div><div></div>",
      "id": "p_09913ef79f3b89dc",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front End Developer",
      "company": "Salt Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/16e2e4041a993a6e6063e3d59df6d41b",
      "location": "Sydney NSW",
      "salary": "$500 - $600 a day",
      "time": "1",
      "rating": null,
      "apply": "https://www.welovesalt.com/au/jobs/technology/front-end-developer-8410/?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><p><b>Front End Developer</b></p>\n<p>\nA leading Australian business is looking for an experienced and detail-oriented Front End Developer to join their high performing tech team. This role will be fast paced and an exciting opportunity to utilise your skills with front end frameworks to develop high quality products.</p>\n<p><b>\nResponsibilities:</b></p>\n<ul>\n<li>Work within an agile development team working in sprints with deliverables and demonstration of results.</li>\n<li>Develop, test, implement, and maintain client/user-facing self-service tools for activities such as benefit elections, manage life events, beneficiary changes, etc.</li>\n<li>Develop, test, implement, and maintain internal/administrative tools such as client web-site configuration tools, processing scripts and continuous integration.</li>\n<li>Write unit tests based on system requirements</li>\n<li>Understand Internet and client/server architectures.</li>\n<li>Understand web based UI technologies such as Javascript (jquery), HTML, CSS, Web Services (REST, SOAP), AJAX</li>\n<li>Understand PHP and PHP MVC Frameworks</li>\n<li>Understand expectations that were set with product owner and recognize when issues/events may affect delivery.</li>\n<li>Create logical and innovative solutions to complex problems.</li>\n<li>Work closely with a variety stakeholders to ensure technical compatibility and user satisfaction.</li>\n<li>Share acquired skills with team members through formal and informal channels.</li>\n<li>Ensure that there is proper documentation of standard procedures.</li>\n</ul>\n<p><b>Required Qualifications/Skills:</b></p>\n<ul>\n<li>5 or more years’ experience as a key developer using <b>Reactjs, HTML 5.0, CSS3, CSS Pre Processors – SASS/LESS, ES6+ JavaScript, Foundation, Bootstrap, Responsive Web Design, Component Web Design, page optimisation</b></li>\n<li>Software development experience including: OOP, concurrency programming, design patterns, RESTful service implementation, Service Oriented Architecture, Test-Driven Development, Acceptance Testing.</li>\n<li>Experience creating tools to automate the deployment of an software solution to the cloud</li>\n<li>Strong object-oriented design and development experience</li>\n<li>Knowledge of design patterns and their implementation</li>\n<li>Multi-threaded design and development</li>\n<li>Extensive experience in at least one modern JavaScript MV-VM/MVC frameworks (Angular2+, JQuery, NodeJS, GruntJS)</li>\n<li>Strong expertise with HTML, CSS, and writing cross-browser compatible code.</li>\n<li>Good understanding of AJAX and JavaScript Dom manipulation Techniques</li>\n<li>Experience in TypeScript.</li>\n<li>Familiarity with testing frameworks and test runners</li>\n<li>Experience with complex Angular5+ modules, components, services and dependency injections</li>\n</ul>\n<p>If you have the necessary experience and qualifications and believe you would be a great fit for this position, apply now!</p>\n<p>\nSalt is acting as an Employment Business in relation to this vacancy.</p>\n<p></p>\n<div><h3 class=\"jobSectionHeader\"><b>Job Information</b></h3><div><div>\nJob Reference: JO-2004-166741</div><div>\nSalary: AU$500 - AU$600 per day</div><div>\nSalary per: day</div><div>\nJob Duration:\n</div><div>Job Start Date: ASAP</div><div>\nJob Industries: Technology</div><div>\nJob Locations: Sydney</div><div>\nJob Types: Contract</div><div>\nJob Skills: Bootstrap, Component Web Design, CSS Pre Processors - SASS/LESS, CSS3, ES6+ JavaScript, Foundation, HTML 5.0, page optimisation, ReactJs, Responsive Web Design</div></div></div></div>",
      "id": "p_c841050afd7671ad",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Frontend Web Developer",
      "company": "Clicks IT Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9cf7aca3c385c5dbc37794db3e069c87",
      "location": "Melbourne City Centre VIC",
      "salary": null,
      "time": "4",
      "rating": "5.0",
      "apply": "https://clicks.com.au/jobs/permanent-it-jobs/in-melbourne-cbd/bbbh64791-senior-frontend-web-developer/",
      "content": "<b>About you :</b><br>\nSignificant experience working with the current best practices and technologies for frontend web development such as HTML5, CSS3, SASS, Bootstrap, JavaScript, ES6, React, VueJS and jQuery.\n<br>Experience building scalable, standard-compliant, cross-platform and responsive websites using industry best practices including WCAG and usability standards, implementing visual design and UX/UI and turning conceptual design and user interface mock-ups and wireframes into functional websites.\n<br>Great communicator with a strong understanding of web development and web testing practices.\n<br>Duties\n<br><br>\nProvides specialist knowledge and expertise in frontend web development, web content management (Drupal), software development project management methodologies, and the software development life cycle.\n<br>Translate business goals into technical requirements and provide technical recommendations to achieve the business goals.\n<br>Manage the design, development and implementation of projects to deliver enhanced online systems and services, particularly for the website and web content management system.\n<br>For further information please contact Ratika Dhupar at Clicks IT Recruitment on 03 9963 4820.\n<br><br>\nType\n<br>Permanent\n<br><br>\nCategory\n<br>Project / Program / PMO support\n<br><br>\nReference ID\n<br>BBBH64791",
      "id": "p_7c3c04e920a20f85",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Analyst Programmer - Based in Sydney CBD",
      "company": "Clicks IT Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9cf7aca3c385c5dbc37794db3e069c87",
      "location": "Sydney Central Business District NSW",
      "salary": null,
      "time": "4",
      "rating": "5.0",
      "apply": "https://clicks.com.au/jobs/contract-it-jobs/in-sydney-cbd/bbbh65280-analyst-programmer-based-in-sydney-cbd/",
      "content": "A well-established organisation is looking for an experienced Analyst Programmer. This is a 12-month contract and is based in Sydney CBD.\n<br><br>\nThe role is responsible for the analysis, development and implementation of new systems and software to meet operational requirements.\n<br><br>\n<b>Essential requirement:</b><br>\nCustomer-centric attitude to teamwork and delivery\n<br>Ability to work independently and reliably deliver on expected outcomes\n<br>Experience with application development on Azure Cloud\n<br>Familiarity with Azure Cloud native services\n<br>Sound understanding of Web application development technologies, including but not limited to HTML, CSS, JavaScript Frameworks\n<br>Experience in relational database deployment and maintenance, especially Microsoft CDS and AzureSQL\n<br>For further information please contact Freda Kwok at Clicks IT Recruitment on 02 9200 4404.\n<br><br>\nType\n<br>Contract\n<br><br>\nCategory\n<br>Project / Program / PMO support\n<br><br>\nReference ID\n<br>BBBH65280",
      "id": "p_579f7d2e9e5a1f66",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Developer",
      "company": "Chandler Macleod",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/617777d595cf9ccf7e4c38d5cd474371",
      "location": "Victoria",
      "salary": null,
      "time": "10",
      "rating": "3.6",
      "apply": "https://www.chandlermacleod.com/job/full-stack-developer-2?utm_source=indeed&utm_medium=organic&utm_campaign=indeed",
      "content": "<div><p>Our client a well known Federal Government department is seeking an experienced Full Stack Developer to join their team up until the end of October 2020 plus extesions.\n</p><p></p><p><b>About the role:</b></p><p>\nFull Stack Developer who will undertake technical landscape design, installation, configuration, deployment, technical security and operation of ICT components and databases. The role works under the limited direction of senior technical staff. They exercise both initiative and judgement in the interpretation of policy and in the application of practices and procedures. Decision making is substantially dependent on judgement, skills and knowledge. The role manages and organises your own work in the context of competing priorities within the constraints of the delivery vehicle you are engaged with at the time.</p><p><br>\n<br>\n<b>Experience Required:</b><br>\n</p><ul><li>Experience with Government Agencies highly regarded</li><li>\nPublic/Private cloud technologies, patterns and techniques</li><li>\nOpen source development paradigms</li><li>\nAgile development practices</li><li>\nSpecific technologies including:<br>\no NodeJS<br>\no Kafka<br>\no Kong<br>\no OpenShift<br>\no MongoDB</li></ul></div>",
      "id": "p_bd6dbfe135b77b3c",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Ambition",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/c87617cdf67b09ef5d9be725cfc352cb",
      "location": "Southbank VIC",
      "salary": "$120,000 a year",
      "time": "11",
      "rating": null,
      "apply": "https://www.ambition.com.au/job/software-developer-3/?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><p><b>Software Developer</b></p><p><br>\n<b>Ruby / Rails / SQL / AWS / Node / Lambda</b><br>\n<br>\nMy client is a very exciting Melbourne based company looking to bring on board a Software Developer in a permanent position. The client in question is rapidly growing, with this opportunity a chance to be part of something truly special.<br>\nYou, the successful candidate, will be joining a very high level development team with great personal development working within a collaborative environment.</p><p><b>\nTech:</b></p><ul><li>\nProven track record developing apps using Ruby, Rails, Lambda (Python)</li><li>\nCommercial experience in an agile environment</li><li>\nExperience in cloud technologies (AWS)</li></ul><p><br>\n<b>Requirements:</b></p><ul><li>\nAt least 4 to 6 years of relevant industry experience</li><li>\nPassionate about creating high quality code and user experience</li><li>\nA multi-tasker, with excellent management skills</li><li>\nStrong communication skills</li><li>\nAustralian citizen or resident</li></ul><p>\nIf this is something that you would be of interest and would like to have a confidential discussion, please hit 'APPLY' or contact Dan at 03 8629 1015.</p></div><p></p>",
      "id": "p_191e401ed51b4767",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front End Developer",
      "company": "HAYS",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/e2e8c9f276f1965722c0fc62327484f6",
      "location": "Canberra ACT",
      "salary": "$80,000 - $100,000 a year",
      "time": "3",
      "rating": "3.6",
      "apply": "https://www.hays.com.au/jobs-search/front-end-developer-act-canberra-en-AUS_2381514?jobsource=indeedOrganic&utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div>Forward thinking company who have a proven track record of delivering industry leading solutions<div><br>\n<b>\nYour new company</b>\n<br>\n<br>\nMy client is a Mission Systems company and they develop mission critical solutions across the land, sea, air, space and cyber domains. 50% of their workforce are engineers which makes for an environment that thrives on innovation and agility.<br>\n<br>\n<b>Your new role</b>\n<br>\n<br>\nYou will responsible for the delivery, on-going success and evolution of one or more products and/or platforms. You will work within an Agile/lean environment as part of a multidisciplinary team delivering enhancements to both new and existing products.<br>\n<br>\n<b>What you'll need to succeed</b>\n<br>\n<br>\n<ul><li>Working knowledge of agile development practices and experience working in agile/lean environments – specifically experience working in a test driven environment.</li><li>Strong User Experience and UI Design skills, including wirframing and protoyping</li><li>Experience building application front-ends including experience with Vue or a similar framework (Angular, React, Svelte)</li><li>Experience with Docker or other containerisation software (exposure to Docker Swarm ideal) Experience working in a Linux environment (experience dealing with Linux firewalls ie iptables and firewalld would be ideal as well)\n</li><li>4+ years experience designing, implementing &amp; releasing web applications using, Javascript (ES2015 or newer), HTML5, CSS3, JSON, XML\n</li><li>Experience with web page optimisation, scaling web applications to ensure good performance and responsiveness</li></ul><br>\n<b>What you need to do now</b><br>\n<b>\n</b><br>\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or contact me on owen.chetty@hays.com.au now.<br>\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.<br>\n<br>\n<b>LHS 297508</b> #2381514</div></div>",
      "id": "p_67ea6176386f2a52",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Web/Full Stack Developer",
      "company": "Titan Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/ada62d349184a6ddf2d607887a7c3dad",
      "location": "Subiaco WA",
      "salary": "$150,000 a year",
      "time": "5",
      "rating": null,
      "apply": "https://www.titanrecruitment.com.au/job/100572533407067/web-slash-full-stack-developer/?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><div><b>About the Role:\n</b><br>\nOur client seeks a highly experienced Web Full-Stack Developer to join them in their exciting and innovative journey into interactive technology. As part of their growing team you will be working to change the way their clients brand and communicate to their customer base through digital devices.<br>\n<br>\nThis Full-Time position is based just outside Perth CBD, where you will report to the Senior Architect who will oversee development. With strong growth projected, the right candidate will have the potential to mentor and coach Junior Developers.<br>\n<br>\n<b>Key Criteria:</b><br>\n<ul><li>\nStrong Web Development skills\n</li><li>JavaScript and Backend Database experience (preferably in Firebase)\n</li><li>Google Cloud experience (BigQuery) is not essential, but highly regarded</li><li>\nBig Data, Data Lake and Data Reporting experience\n</li></ul><br>\n<i>Highly proficient in the following technologies:</i><br>\n<ul><li>\nHTML</li><li>\nCSS</li><li>\nJavaScript/TypeScript</li><li>\nRestful Services (API's)</li></ul><br>\n<ul><li>\nExperience working with NoSQL database - BigQuery</li><li>\nProficient in Cloud functions\n</li><li>Experience working with Designers and contributing to UI/UX decisions\n</li><li>Big BONUS - If you possess any Android Development experience and/or Advertising Integration experience.</li></ul><br>\nWe ideally want someone who has experience with a broad and modern tech stack and experience in product development.<br>\n<br>\n<b>What's on Offer:</b><br>\nThis opportunity is an excellent chance for a mid-senior level Web/Full-Stack Developer to join an up and coming organisation looking to expand their platform on native devices, giving their partners the ability to reach consumers on applications that have never been accessible before.\n<br>\n<br>\nThis is not your typical start-up organisation; our client, established for four years now, have strong backing from their Directors and Board Members. Their office is a very open and honest working environment where no two days are the same; you get to work on exciting technologies and continue your technical development and to top it off you get to own your work!<br>\n<br>\n<b>Our Client\n</b><br>\nOur client is driven by delivering never seen before messaging services providing deeper integration into consumer's day-to-day consumption and by delivering unique market opportunities while providing value and control to users.<br>\n<br>\n<b>About Us</b><br>\nTitan Recruitment has been delivering complete, innovative and effective recruitment solutions across Australia for over two decades and is recognised as a leading Engineering and Technology recruitment and contracting specialist. Our service delivery is underpinned by traditional values and an innovative approach to help clients, contractors and candidates achieve their goals.<br>\n<br>\nFind the latest engineering jobs and technology jobs at www.titanrecruitment.com.au\n<br>\n<br>\n<i>Titan is an advocate for Equal Employment Opportunity, and we encourage applications from all interested applicants.</i></div></div>",
      "id": "p_6295d680edf232de",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "HiTech Personnel",
      "companyLogo": null,
      "location": "Canberra ACT",
      "salary": null,
      "time": "11",
      "rating": null,
      "apply": "http://hitechaust.com/searchjob/details/jf-jb0289",
      "content": "<p></p><div><div><div><div><div><ul><li>High Profile Federal Government Department\n</li><li>Initial Contract until 31 December 2020 + Extension\n</li><li>Lucrative Hourly Rates $$\n</li></ul>One of Australia's most highly regarded Federal Government Departments is seeking to engage an experienced <b>Software Developer </b>to join a dynamic team integrating software across multiple platforms and environments within the department. The <b>Software Developer </b>will be offered an initial 9-month contract with a view to further extend at a rewarding hourly rate.\n<br>\n<br>\n<b>The successful Software Developer will be responsible for, but not limited to;\n</b><ul><li>Developing external facing web applications\n</li><li>Performing maintenance work / production support to exiting application (BAU)\n</li><li>Supporting and troubleshoot technical requirements and complex business / technical issues to achieve the desire outcome\n</li></ul><b>The successful Software Developer must have experience in the following:\n</b><ul><li>Minimum 5 years’ experience as a Software Developer developing complex .NET applications\n</li><li>Demonstrated experience in using Visual Studio, ASP.NET MVC, WCF, C#, Angular and Team Foundation Server (TFS)\n</li><li>Knowledge in developing mobile responsive web applications\n</li><li>Proven experience in maintaining product backlog items, bugs and change requests using Microsoft DevOps\n</li><li>Ability to deliver results crossing multiple IT disciplines, including requirements identification, technical analysis, code development, code review, and system documentation\n</li><li>Experience in detailed technical analysis and implement design solutions to meet end user requirements\n</li></ul>This is an exciting opportunity for a talented and highly motivated <b>Software Developer </b>to showcase their experience. The successful <b>Software Developer </b>will be offered an initial contract until 31 December 2020 plus extension option at a competitive hourly rate. If you have the required skills, <b>DON'T DELAY, APPLY NOW</b> please forward your resume to <b>jobs@hitechaust.com</b> quoting ref number <b>JB0289</b> today!</div></div></div></div></div><p></p>",
      "id": "p_9849f5567257ea43",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Sitecore Developer",
      "company": "icare NSW",
      "companyLogo": null,
      "location": "Sydney Central Business District NSW",
      "salary": "$128,089 a year",
      "time": "8",
      "rating": null,
      "apply": "https://careers.icare.nsw.gov.au/cw/en/job/494217/senior-sitecore-developer",
      "content": "<div><p><b>icare is currently seeking an experienced Senior Sitecore Developer with a commercial mindset and a passion for social impact to join the icare team!\n</b></p><ul><li>Gather, refine and estimate specifications and requirements based on business and/or technical needs</li>\n<li>Permanent opportunity</li>\n<li>Salary from $128,089 + super</li>\n</ul>\n<p>We’re looking for someone who has experience with technical responsibilities across all products and includes product maintenance and improvement. This role will use programming expertise and have a deep understanding of modern web architectures and distributed systems.</p>\n<p>\nYou’ll be working with a diverse mix of creative, curious and smart people who really care about making a difference for people and the NSW community. You will have a mind for getting things done and a heart for people and you will set the bar high through the quality of the work you do and the people-oriented decisions you make.</p>\n<p>\nYou’ll bring your experience working with Sitecore 9.x, C#, .Net, nuget, and Demonstrated working experience with UI frameworks (jQuery, React). Understanding of cross browser and device testing and debugging techniques, also Anticipate and assess changes which impact the business and exercise judgement in the absence of precedent and make decisions with significant impact.</p><br>\n<p></p>\n<p>\nIt’s an exciting environment where no two days are the same. But on a typical day you might find yourself: Build out patterns and abstractions that emphasize the efficiency of sites and software.</p>\n<ul>\n<li>Design and develop both internal and external facing services for enterprise application Integration of applications hosted on site and in the cloud.</li>\n<li>Manage the entire software development lifecycle including analysis, design, coding, testing, build, deployment, implementation, release and support for a product.</li>\n<li>Collaborate with infrastructure team, and other software developers to assist in resolving problems with software products or company software system.</li>\n<li>Integrate data from various back-end services and databases and participate in code reviews.</li>\n<li>Collaborate with other developers and business analysts in conceptualising and developing new software applications and enhancements and participate in project estimation and discovery sessions.</li>\n<li>Create technical documents and artefacts for developed software products.</li>\n</ul>\n<p>We’re a new kind of organisation, one that’s as supportive and socially conscious as it is agile and explorative. Our DNA of commercial mind and social heart captures who we are at our core.</p>\n<p>\nIf you think you’re the right person for this role, send us your resume (up to 5 pages). Don’t delay as we’re assessing applications as they are received. We’d love to hear how your capabilities, achievements and experience set you apart.</p>\n<p>\nWe know our strength comes from the diversity of our people and so we want people with different experiences and backgrounds to apply. We recognise the importance of balance and flexibility and understand that it’s not a one size fits all approach, so we’d be happy to talk about and consider your specific needs.</p>\n<p>\nPlease note that you must be an Australian citizen or a permanent resident of Australia or a New Zealand citizen with a current New Zealand passport to apply for this role.</p>\n<ul>\n<li>icare is the brand of Insurance &amp; Care NSW</li>\n<li>For more information about icare visit our website</li>\n<li>icare operates a direct sourcing model so no agency introductions will be accepted</li></ul></div>",
      "id": "p_9bdded5acb7bcc52",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Mid - Senior Front End Developer",
      "company": "Opus Recruitment Solutions",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/2afd4b89cde8c4ca35d5f0d1fc752d60",
      "location": "Melbourne VIC",
      "salary": "$90,000 - $130,000 a year",
      "time": "6",
      "rating": null,
      "apply": "https://www.opusrecruitmentsolutions.com/search-jobs/34904795-mid-senior-front-end-developer-job-australia-melbourne?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><b>Mid - Senior React Developer</b>\n<br>\n<ul><li>Permanent Role within an exciting Digital Agency</li><li>\nGreat opportunity for an experienced, passionate individual.</li><li>\nA chance to work with the latest technology</li></ul>\n<b>The company</b>\n<br>\nOur client is a well established, fast growing Digital Agency with a great reputation. Their attitude is always to bring in the best people in to drive their business forward. They believe in maximising impact through talented developers using the latest in technology. The companies is partnered with a client to work on a React / PHP headless progressive web application, and are looking for expertise to join the team as they are flat out with work.\n<br>\n<br>\nIf you are successful with this application you will play a pivotal role within the company, joining one of their highly talented development teams as a Mid/Senor Frontend Developer. You will need to have a passion for creating fantastic products with a keen interest in JavaScript frameworks. This is an exciting opportunity to be part of a small, high performing agile team delivering best outcomes for high-end clients.\n<br>\n<br>\n<b>To be considered, you will need to demonstrate the following:</b>\n<br>\n<ul><li>3+ years industry experience</li><li>\n2+ years development experience with ReactJS</li><li>\nJavaScript build tools (Grunt/Webpack)</li><li>\nPHP backgournd is HIGHLY regarded</li><li>\nAbility to follow best practice coding methodologies</li><li>\nExperience in building headless E-Commerce applications</li></ul>\nThe benefits are considerable and the workplace is one you definitely want to be in!\n<br>\nIf this sounds like you or someone you know, get in touch with me ASAP!\n<br>\n<br>\nKieran Campbell - Opus</div>",
      "id": "p_2e09f1000f3e45cb",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Developer",
      "company": "FinXL",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/8e390e5d957907b772b9183d164d1823",
      "location": "Brisbane QLD",
      "salary": null,
      "time": "11",
      "rating": null,
      "apply": "https://www.finxl.com.au/job/full-stack-developer-6/",
      "content": "<b>Location:</b><br>\nBrisbane\n<br><br>\n<b>Job Type:</b><br>\nPermanent\n<br><br>\n<b>Specialisation:</b><br>\nTelecommunications\n<br><br>\n<b>Reference:</b><br>\n(VH)49134\n<br><br>\nFinXL IT Professional Services is an established, innovative Australian company, providing technology enabled business solutions and consulting services across a number of industries. These include; Government, Telecommunications, Commercial and Finance. We currently have more than 1200 consultants assisting our clients across Australia and are continuing to grow at a rapid pace. Through the delivery of services and implementation of new systems, processes and technology, we assist our clients to gain competitive advantage and reach new heights.\n<br><br>\nThe Role\n<br><br>\nOur client, a large Brisbane CBD based organisation, is looking for an experienced Full Stack Developer to start on 8th April 2020.\n<br><br>\n<ul>\n<li>Develop large scope e-commerce products or platforms</li>\n<li>Monitor and operate production-level service</li>\n<li>Working on continuously improving user experience and delivering customer value</li>\n</ul>\nWho you are\n<br><br>\nYou will have the following skills/experience\n<br><br>\n<ul>\n<li>Proven experience developing with React (frontend)</li>\n<li>Hands-on Node and Express experience (backend)</li>\n<li>Good understanding of MongoDB and PostgreSQL</li>\n<li>Understanding of Spring Boot</li>\n<li>Experience working in an Agile environment</li>\n<li>Experience with large scale single page web applications</li>\n<li>Good communication skills</li>\n</ul>\nWhat’s on offer\n<br><br>\nThis is a 12 months’ engagement which will turn into a permanent role with the client.\n<br><br>\nWhat’s next\n<br><br>\nIf you would like to be considered, please send your application to Julia Leung on julial@finxl.com.au",
      "id": "p_36c382ead6941a1c",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "HiTech Personnel",
      "companyLogo": null,
      "location": "Canberra ACT",
      "salary": null,
      "time": "11",
      "rating": null,
      "apply": "http://hitechaust.com/searchjob/details/jf-jb0289",
      "content": "<p></p><div><div><div><div><div><ul><li>High Profile Federal Government Department\n</li><li>Initial Contract until 31 December 2020 + Extension\n</li><li>Lucrative Hourly Rates $$\n</li></ul>One of Australia's most highly regarded Federal Government Departments is seeking to engage an experienced <b>Software Developer </b>to join a dynamic team integrating software across multiple platforms and environments within the department. The <b>Software Developer </b>will be offered an initial 9-month contract with a view to further extend at a rewarding hourly rate.\n<br>\n<br>\n<b>The successful Software Developer will be responsible for, but not limited to;\n</b><ul><li>Developing external facing web applications\n</li><li>Performing maintenance work / production support to exiting application (BAU)\n</li><li>Supporting and troubleshoot technical requirements and complex business / technical issues to achieve the desire outcome\n</li></ul><b>The successful Software Developer must have experience in the following:\n</b><ul><li>Minimum 5 years’ experience as a Software Developer developing complex .NET applications\n</li><li>Demonstrated experience in using Visual Studio, ASP.NET MVC, WCF, C#, Angular and Team Foundation Server (TFS)\n</li><li>Knowledge in developing mobile responsive web applications\n</li><li>Proven experience in maintaining product backlog items, bugs and change requests using Microsoft DevOps\n</li><li>Ability to deliver results crossing multiple IT disciplines, including requirements identification, technical analysis, code development, code review, and system documentation\n</li><li>Experience in detailed technical analysis and implement design solutions to meet end user requirements\n</li></ul>This is an exciting opportunity for a talented and highly motivated <b>Software Developer </b>to showcase their experience. The successful <b>Software Developer </b>will be offered an initial contract until 31 December 2020 plus extension option at a competitive hourly rate. If you have the required skills, <b>DON'T DELAY, APPLY NOW</b> please forward your resume to <b>jobs@hitechaust.com</b> quoting ref number <b>JB0289</b> today!</div></div></div></div></div><p></p>",
      "id": "p_9849f5567257ea43",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Application Developer",
      "company": "Hydro Tasmania",
      "companyLogo": null,
      "location": "Melbourne VIC",
      "salary": null,
      "time": "1",
      "rating": "4.7",
      "apply": "https://careers.pageuppeople.com/901/ht/en/job/495353/application-developer?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div></div><div><div><b>Job no:</b> 495353<br>\n<b>Work type:</b> Permanent Full time<br>\n<b>Location:</b> Melbourne<br>\n<b>Categories:</b> Information Technology<br>\n</div>\n<div><ul><li><b>Use your skills in ASP.NET and Salesforce</b></li>\n<li><b>Join Hydro Tasmania’s Retail Technology team at Momentum Energy\n</b></li><li><b>2 permanent positions in Melbourne CBD</b></li>\n</ul>\n<p><b>Hydro Tasmania is Australia's largest producer of renewable energy and is a leader in creating a clean energy future for Australia. We believe a diverse and inclusive workplace brings out the best in our people and helps provide a better service to our customers. Continuing growth, excellent working conditions and career opportunities make Hydro Tasmania and its subsidiaries Momentum Energy and Entura a great place to work.</b></p>\n<p><b>\nAbout the role:</b><br>\nAs a member of the Hydro Tasmania’s Information Services and Systems within our Momentum Energy Retail business in Melbourne, and you’ll develop and support application software for specific business solutions.</p>\n<p><b>\nWhat it looks like:</b></p>\n<ul>\n<li>Developing solutions to the intended solution architecture with the digital team</li>\n<li>Building systems using tools such as TDD, BDD, CI/CD and automation</li>\n<li>Ensuring that documentation produced for solutions</li>\n<li>Working closely with Digital Product Owner, UX and BA resources to ensure development solution outcomes are met</li>\n<li>Working with the Scrum Master and Digital Product Owners, with technical guidance being provided by the Digital Team Lead</li>\n<li>Collaborating with all members of agile development teams across the organisation and help drive the agile transformation</li>\n</ul>\n<p><b>Your technical skills and experience are in:</b></p>\n<ul>\n<li>ASP.NET</li>\n<li>Salesforce Lightning Web Component (LWC)</li>\n<li>Strong development skills in React or Angular 2, AWS and/or another commercial cloud provider</li>\n<li>Development experience in one or more of the following languages: Javascript/Typescript, Java, Python, .net, React, HTML, CSS, SASS or LESS, Single Page Application</li>\n<li>CMS such as Sitefinity or Sitecore</li>\n<li>Delivering solutions designed as Microservices or Microfrontends</li>\n<li>Integrating with Adobe, Google or other analytics platforms</li>\n</ul>\n<p><b>Other things about you:</b><br>\nYou’ll bring outstanding stakeholder engagement skills, along with exceptional communication skills, and you’re skilled in driving results and efficiently contributing to innovative customer solutions. You understand targets and timelines have an ability to transform ambiguity into solutions through collaboration and creativity. You’ll also bring demonstrated similar development experience from an agile process and SCRUM environment.</p>\n<p><b>\nWhat we offer:</b><br>\nLocated in fantastic Melbourne CBD offices, you’ll work in a collaborative team environment, and in an incredibly fun and rewarding business that values its people and customers. You’ll receive an attractive salary, benefits that include wellness programs, discounted electricity and gas, and flexible working arrangements.</p>\n<p><b>\nIf you like the sound of this role, we’d love to hear from you!</b><br>\nTo apply for this position, please attach your resume and a cover letter detailing what you’ll bring to the position.\n<br>\n<br>\n<b>Applications close at 9:00am on Friday 8th May 2020</b></p>\n</div>\n<p><b>Advertised:</b> 24 Apr 2020 AUS Eastern Standard Time<br>\n<b>Applications close:</b> 08 May 2020 AUS Eastern Standard Time</p></div><p></p>",
      "id": "p_d3843b811de6a403",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Application Developer",
      "company": "Momentum Energy",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9c33eee2f93b3f6073c9823b2cf65a55",
      "location": "Melbourne VIC",
      "salary": null,
      "time": "1",
      "rating": "3.7",
      "apply": "https://www.momentumenergy.com.au/careers?job=495353",
      "content": "<div><h3 class=\"jobSectionHeader\"><b>Application Developer</b></h3>\n<ul><li><b>Use your skills in ASP.NET and Salesforce</b></li>\n<li><b>Join Hydro Tasmania’s Retail Technology team at Momentum Energy\n</b></li><li><b>2 permanent positions in Melbourne CBD</b></li>\n</ul>\n<p>Hydro Tasmania is Australia's largest producer of renewable energy and is a leader in creating a clean energy future for Australia. We believe a diverse and inclusive workplace brings out the best in our people and helps provide a better service to our customers. Continuing growth, excellent working conditions and career opportunities make Hydro Tasmania and its subsidiaries Momentum Energy and Entura a great place to work.</p>\n<p>\nAbout the role:<br>\nAs a member of the Hydro Tasmania’s Information Services and Systems within our Momentum Energy Retail business in Melbourne, and you’ll develop and support application software for specific business solutions.</p>\n<p>\nWhat it looks like:</p>\n<ul>\n<li>Developing solutions to the intended solution architecture with the digital team</li>\n<li>Building systems using tools such as TDD, BDD, CI/CD and automation</li>\n<li>Ensuring that documentation produced for solutions</li>\n<li>Working closely with Digital Product Owner, UX and BA resources to ensure development solution outcomes are met</li>\n<li>Working with the Scrum Master and Digital Product Owners, with technical guidance being provided by the Digital Team Lead</li>\n<li>Collaborating with all members of agile development teams across the organisation and help drive the agile transformation</li>\n</ul>\n<p>Your technical skills and experience are in:</p>\n<ul>\n<li>ASP.NET</li>\n<li>Salesforce Lightning Web Component (LWC)</li>\n<li>Strong development skills in React or Angular 2, AWS and/or another commercial cloud provider</li>\n<li>Development experience in one or more of the following languages: Javascript/Typescript, Java, Python, .net, React, HTML, CSS, SASS or LESS, Single Page Application</li>\n<li>CMS such as Sitefinity or Sitecore</li>\n<li>Delivering solutions designed as Microservices or Microfrontends</li>\n<li>Integrating with Adobe, Google or other analytics platforms</li>\n</ul>\n<p>Other things about you:<br>\nYou’ll bring outstanding stakeholder engagement skills, along with exceptional communication skills, and you’re skilled in driving results and efficiently contributing to innovative customer solutions. You understand targets and timelines have an ability to transform ambiguity into solutions through collaboration and creativity. You’ll also bring demonstrated similar development experience from an agile process and SCRUM environment.</p>\n<p>\nWhat we offer:<br>\nLocated in fantastic Melbourne CBD offices, you’ll work in a collaborative team environment, and in an incredibly fun and rewarding business that values its people and customers. You’ll receive an attractive salary, benefits that include wellness programs, discounted electricity and gas, and flexible working arrangements.</p>\n<p>\nIf you like the sound of this role, we’d love to hear from you!<br>\nTo apply for this position, please attach your resume and a cover letter detailing what you’ll bring to the position.\n<br>\n<br>\nApplications close at 9:00am on Friday 8th May 2020</p></div><p></p>",
      "id": "p_ba0e2187d38212ed",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Principal Web Developer",
      "company": "Queensland Government",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/e76e09dc8f4d06e619c0655c5f5d00c0",
      "location": "Brisbane QLD",
      "salary": null,
      "time": "3",
      "rating": "4.0",
      "apply": "https://smartjobs.qld.gov.au/jobtools/jncustomsearch.viewFullSingle?in_organid=14904&in_jncounter=222007862&in_site=Indeed",
      "content": "Communication and Engagement\n<br><b>Our contribution:</b> the Communication and Engagement branch provides corporate governance, strategic direction and professional advice on communication to corporate and business areas within the department.\n<br><b>Our focus:</b> developing and managing internal and external communication activities, including communication strategies, policies and processes, media relations, online and multi-media communication, publications, events, and client and community engagement strategies.\n<br><br>\n<b>Your contribution:</b><b>You will:</b><br>\n<ul>\n<li>Deliver a customer-focused and engaging web experience through technical design and development.</li>\n<li>Research and maintain an active working knowledge of current and emerging technologies/online best practices in the field of web development to improve customer access to information.</li>\n<li>Manage the technical development and maintenance of the departmental public websites based on a thorough understanding of user requirements and the capabilities of the content management system (Squiz Matrix).</li>\n<li>Maintain awareness of current and emerging web and whole-of-government publishing strategies, policies, standards and guidelines including W3C, consistent user experience, accessibility etc. and participate in discussion and development of emerging standards/guidelines.</li>\n<li>Ensure technical website development is compliant with Queensland Government Information Standards, legislative requirements, and other relevant technical policies, standards and administrative procedures.</li>\n<li>Plan, design, develop and implement technical solutions to address various departmental business requirements and evaluate and re-develop existing websites and components to improve functionality, usability, accessibility and overall user experience.</li>\n<li>Ensure the successful technical design, development and implementation of Squiz Matrix including the configuring and testing of the CMS.</li>\n<li>Provide technical advice, support and training to other members of the Online and Digital Communication team, and provide recommendations and advice to the Manager, Online and Digital around web-based technologies and the project manager for the internet redevelopment project.</li>\n<li>Provide advice and direction to departmental clients regarding web solutions and communicate publishing processes, policies, standards and guidelines to colleagues and web authors.</li>\n<li>Demonstrate the ability to rapidly learn and acquire new functional and technical knowledge and skills, both front-end and back-end.</li>\n</ul>\nSpecial requirements\n<br><br>\n<b>Demonstrated experience developing applications with:</b><br>\n<ul>\n<li>Squiz CMS</li>\n<li>JavaScript/jQuery</li>\n<li>HTML5</li>\n<li>CSS</li>\n<li>BOOTSTRAP</li>\n<li>Content management system experience</li>\n</ul>\n<b>Any experience with the following would be beneficial:</b><br>\n<ul>\n<li>Shell scripting</li>\n<li>Git or other SCM</li>\n<li>AGILE project management</li>\n<li>Google Maps</li>\n<li>UX/UI wireframing</li>\n</ul>\nFor further information on the role and what we're looking for, please refer to the role description\n<br>Applications to remain current for 12 monthsThis work is licensed under a Creative Commons Attribution 3.0 Australia License.",
      "id": "p_08f80e396f019c22",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front-end Developer",
      "company": "Auto & General Insurance",
      "companyLogo": null,
      "location": "Toowong QLD",
      "salary": null,
      "time": "8",
      "rating": "3.9",
      "apply": "https://autogeneralservices.secure.force.com/JobDetailsAAndG?id=a060o00001bakctAAA&location=&keywords=&cp=1&cat=&source=indeed",
      "content": "<div></div><div><div>Work Type : Full Time</div>\n<div></div><div>Location : QLD</div>\n<div></div><div><ul><li>Integral, Angular Development Opportunity</li>\n<li>Work alongside some of Australia’s most highly regarded developers</li>\n<li>Toowong location</li>\n</ul></div><div><p><b>The Role:</b><br>\n<br>\nAs a front-end developer, you will be building out applications to allow customers to buy and manage their policies online. You will also be contributing to the development of internal applications used by our staff to support business operations. Being a specialist in front-end, you will be designing and developing Typescript and CSS to implement goals of the sprint and deliver high value to stakeholders across the business.<br>\n<br>\n<b>Knowledge and Experience:</b></p>\n<ul><li>2+ years’ experience with Angular JS &amp; Angular 2 – 7;</li>\n<li>Experience with JSP app development (desirable);</li>\n<li>Extensive commercial experience with JavaScript and/or Typescript;</li>\n<li>Experience with server-side technology (eg: Java, PHP, Ruby, Node);</li>\n<li>Understanding of security implications for web applications (OWASP).</li>\n<li>Working knowledge of Git, BitBucket, Jenkins (or equivilent);</li>\n<li>AWS DevOps experience (desirable, not essential); and</li>\n<li>A background in financial services applications (desirable, not essential).</li><br>\n</ul>\n<p><br>\n<b>Who are Auto &amp; General:</b><br>\n<br>\nAuto &amp; General is the Australian arm of a private global group with 8,000 employees across 31 offices and over 8.9 million customers worldwide.<br>\n<br>\nIn Australia, Auto &amp; General launched in 2000 and has grown to provide industry-leading motor, home and travel insurance products both directly through Budget Direct and via industry leading partnerships. With an Australian team of 1400+ we are now looking for talented individuals who can help drive our ambitious growth plans.<br>\n<br>\n<b>Our Benefits:</b></p>\n<ul><li>Toowong - City fringe location;</li>\n<li>Enjoy additional leave days - ‘ME’ leave and ‘Volunteer Day’ leave;</li>\n<li>Join our vibrant social and community activities including annual celebration, family fun days and regular events across each of our sites;</li>\n<li>Study support (up to 50% of tuition fees for relevant courses) and professional membership reimbursement;</li>\n<li>Employee discounts on Car, Home, Travel insurance;</li>\n<li>Income protection insurance provided to support you in the event of non-work related illness or injury;</li>\n<li>Discounts with a broad range of providers, including gym memberships, accommodation, dental care and more.</li><br>\n</ul><p>\n<br>\n<i>Auto &amp; General welcome and value diversity in the workplace</i><br>\n<br>\n*A note from Auto &amp; General to recruitment agencies: We politely ask that you avoid making any approaches or sending any unsolicited resumes to our Recruitment Team or Hiring Leaders across our business. Auto &amp; General is not responsible for any fees related to unsolicited resumes.<br>\n<br>\n#LI-JR1</p></div></div>",
      "id": "p_129804a6e5952511",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Software Developer - React, Django",
      "company": "Greythorn",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/a1ec8b14903472404852caee5c6c6564",
      "location": "Sydney NSW",
      "salary": null,
      "time": "2",
      "rating": null,
      "apply": "https://www.greythorn.com.au/i-t-and-t-jobs/senior-software-developer-react-django/2996534?source=Indeed",
      "content": "<div><ul><li>Work remotely with a product development organisation</li><li>\n2 rounds of Video chat, Immediate start</li><li>\n3 rounds of interview with an option to convert to perm</li></ul><p>\nExciting contract to perm role available for Senior Front End Dev/ Sr Software Developer with expert level experience in React.\n</p><p>You will join a leading product development company to help build Secure HR systems for the government.</p><p><b>\nSenior Software Developer- React</b></p>\n<ul>\n<li>Initial 3 months contract with an option to extend or go permanent.</li>\n<li>Work remotely from home, so you can be based anywhere in Australia.</li>\n<li>This role is open to Australian Citizens and PR. Police clearance will be required.</li>\n<li>2 Rounds of video interview, Immediate start\n</li></ul><p><b>About</b>:\n</p><ul><li><b>Project</b>: Develop software around HR recruitment systems, talent application mapping, accessibility &amp; security vetting for government employees.</li>\n<li><b>Due</b> : 2 releases are due in July and Dec 2020.</li>\n<li><b>Team</b>: 3 Developers as of now, looking for the 4 developer\n</li></ul><p><b>Technical skills:</b></p>\n<ul>\n<li>A min of 6- 10 years of Software Development experience</li>\n<li>At least 3-5 years of experience in <b>React</b> (front end development focused role)</li>\n<li>At least - 2 years of experience in <b>Django and Python\n</b></li></ul><p><b>Soft Skills:</b></p>\n<ul>\n<li>Friendly, go to person in the team, easy going with exceptional communication skills,\n</li><li>Provide ideas and suggestions, give directions and mentor when needed.</li>\n</ul><p></p><p><b>\nNivy Sahoo</b><br>\n<b>Digital/Development</b><br>\n<b>Candidate Manager</b><br>\n<b>Let's Connect</b><br>\n<b>https://www.linkedin.com/in/niveditasahoo/</b><br>\n<b>+61 2 9263 8654</b><br>\n</p>\n<p><i>\nBy submitting your resume and other personal information with this application you are consenting to this information being collected in line with our privacy policy. Follow the link to learn more</i> - www.greythorn.com.au/privacy-policy</p>\n<p>\nState: QLD, licensee/s Manpower Services (Australia) Pty Ltd, LHL-02026-D5L4Q. State: QLD, licensee/s Greythorn Pty Ltd, LHL-02014-Y5F6D. State: SA, licensee/s Manpower Services (Australia) Pty Ltd, LHS 288856, State: SA, licensee/s Greythorn Pty Ltd, LHS 288821. For queries relating to 'Labour Hire Licences' ONLY please contact: 'labour.hire.licensing.enquiries@au.manpowergroup.com' (do not apply to the advert using this email).</p><br>\nBBBH105243_158762104995121</div>",
      "id": "p_8801fa744906decc",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Software Developer",
      "company": "Opus Recruitment Solutions",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/2afd4b89cde8c4ca35d5f0d1fc752d60",
      "location": "Sydney NSW",
      "salary": "$110,000 - $130,000 a year",
      "time": "11",
      "rating": null,
      "apply": "https://www.opusrecruitmentsolutions.com/search-jobs/34904570-senior-software-developer-job-australia-sydney?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><b>Senior Software Developer</b><br>\n<br>\n<ul><li>Fast growing company where you can develop and grow</li><li>\nImpressive remuneration: up to <b>$130k + Super</b> (dependant on experience)</li><li>\nWork with the latest technology and frameworks to build new platforms</li></ul>\n<br>\nMy client is a highly driven global data analytics company experiencing huge growth. They are looking for a Senior Developer to work alongside the CTO and growing team to build exciting new platforms. They are looking for a passionate and motivated developer who thrives in a highly energetic and passionate environment to join their growing team.<br>\n<br>\n<br>\n<br>\n<b>Responsibilities:</b>\n<br>\n<ul><li>Frontend development using React to build platforms</li><li>\nDevelop web applications using JavaScript, HTML and CSS</li><li>\nBackend development in Python using Flask and Django</li><li>\nIntegrate across a variety of APIs</li><li>\nChallenge and contribute to the clients’ current software design</li></ul>\n<br>\n<b>You Will Have:</b>\n<br>\n<ul><li>Must have strong experience with <b>React</b></li><li>\nHave good experience with Node.js &amp; backend development</li><li>\nStrong attention to detail</li><li>\nPassion, curiosity and the ability to think and work independently</li></ul>\n<br>\n<b>Benefits:</b>\n<br>\n<ul><li>Impressive remuneration: up to <b>$130k</b> <b>+ Super </b>(dependent on experience)</li><li>\nConvenient location – less than 10min walk from Central station</li><li>\nOpportunity for career progression + development</li></ul>\n<br>\nIf you want to join an innovative and exciting company and be rewarded for your hard work then please give me a call or send your CV in <b>word format </b>to me today!\n<br>\n<br>\n02 8289 0121 or Fiona.glover@opusrs.com.au</div>",
      "id": "p_d02231b29ac1b4c9",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "FULL STACK .NET DEVELOPMENT CONSULTANT (C# ANGULAR 4 WEBAPI AZURE)",
      "company": "Dynamo Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/5f5dfcff58c05a7c4254d9816a6b714f",
      "location": "Melbourne VIC",
      "salary": null,
      "time": "11",
      "rating": null,
      "apply": "https://www.dynamorecruitment.com.au/i-t-and-t-jobs/full-stack-net-development-consultant-c-angular-4-webapi-azure-/2989525?source=Indeed",
      "content": "<div><ul><li>JOIN LEADING MS GOLD PARTNER SPECIALISING IN EHEALTH</li><li>\nPERMANENT ROLE</li><li>\nIMMEDIATE START/ WORK FROM HOME</li></ul>\nOur client, a reputable <b>MS Gold Partner in the eHealth</b> space, is seeking a <b>Senior Full Stack Development Consultant to join their growing team on a permanent basis</b>. Due to the current environment, the role will allow you to <b>work from home</b> although in the long-term it will be based onsite, in their head office located <b>Inner East Melbourne.</b><br>\n<br>\nWe are looking for someone with <b>strong end-to-end development experience in high paced projects in an enterprise environment. </b>Candidates will have the ability to <b>adjust rapidly to a dynamic setting</b>, be able to <b>deliver high quality customer facing applications</b> and<b> hit the ground running.</b><br>\n<br>\n<b>Required Skills:</b><br>\n<ul><li>Full-stack development using SQL, Web Services, VSTS/TFS, Visual Studio</li>\n<li>C#</li>\n<li>Web API</li>\n<li>WCF</li>\n<li>JavaScript</li>\n<li>jQuery</li>\n<li>Angular 4+</li>\n<li>CSS/CSS3</li>\n<li>Bootstrap</li>\n<li>HTML/HTML5</li>\n<li>MVC,</li>\n<li>DevExpress</li>\n<li>Telerik</li>\n<li>LESS/SASS</li>\n<li>GIT</li>\n<li>unit testing</li>\n<li>Azure technology such as Azure Search, Azure SQL, Azure Functions.</li>\n<li>Understanding of Object-Oriented Design and Object-Oriented Programming Concepts</li>\n<li>Knowledge and familiarity with Design Patterns and Principles</li>\n<li>webapps</li>\n<li>webjobs</li>\n<li>service bus</li>\n<li>blob storage</li>\n<li>Event Hub<br>\n</li></ul><b>Desirable:</b><br>\n<ul><li>CosmosDB,</li>\n<li>SignalR,</li>\n<li>Selenium,</li>\n<li>Powershell,</li>\n<li>FHIR,</li>\n<li>Vonk,</li>\n<li>Design and development of secure API,</li>\n<li>front-end unit testing, (performance or load testing, integration testing</li>\n<li>mocking framework</li>\n<li>Knowledge in TDD, BDD, CI/CD</li>\n<li>Retail POS/Healthcare/ IT Consultancy/ Managed Services industry experience</li>\n<li>IT Certifications</li>\n</ul>Please apply for more details!<br>\nFREDFULLSTACK</div>",
      "id": "p_291a0422e0e83faa",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "PHP Web Developer",
      "company": "Firesoft People",
      "companyLogo": null,
      "location": "Sunshine Coast QLD",
      "salary": "$90,000 a year",
      "time": "11",
      "rating": null,
      "apply": "https://firesoftpeople.com/job-board/job/2735/",
      "content": "<div><p><b>PHP/Web Developer</b></p>\n<ul>\n<li>Sunshine Coast</li>\n<li>Close to public transport</li>\n<li>Initial work from home</li>\n<li>$80k-$100k + super</li>\n</ul>\n<p>We are looking out for a talented Web Developer to assist in our new development workload while working on new features according to our growth plans. Our sector is NDIS and we place the highest priority on our staff! There is no room for ego's here, ideally, someone who takes great pride in their work and would like a long-term career program in which to develop their skills!</p>\n<p><b>\nMust haves:</b></p>\n<ul>\n<li>PHP 5 years' experience</li>\n<li>AWS</li>\n<li>SQL</li>\n<li>HTML/CSS</li>\n<li>JavaScript</li>\n<li>Version Control</li>\n<li>Examples of websites you have built or worked on (not through WordPress or similar)</li>\n</ul>\n<p><b>The day to day:</b></p>\n<ul>\n<li>Support the development of our core software. Development, testing, deployment and documentation</li>\n<li>Resolve bugs and similar issues</li>\n<li>Database management</li>\n<li>Support/project manage all feature development and maintenance</li>\n</ul>\n<p>Work within a small team of 7-10 developers who are tight knit and enjoy team atmosphere and honesty at every turn. We are looking to build on our exciting culture and take our company to the next level. If this sounds like an opportunity for you then click the apply button now.</p></div><p></p>",
      "id": "p_2bfa6c9b164cc38a",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Clicks IT Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9cf7aca3c385c5dbc37794db3e069c87",
      "location": "New South Wales",
      "salary": null,
      "time": "4",
      "rating": "5.0",
      "apply": "https://clicks.com.au/jobs/contract-it-jobs/in-nsw-other/bbbh65253-software-developer/",
      "content": "We are looking for Software Developers for a Federal government client in Canberra.\n<br><b>Duration:</b> Till December 2020 with extension.\n<br><b>Security Clearance:</b> NV1 clearance is preferred, candidates with Baseline may be considered.\n<br><br>\n<b>Role and Responsibilities:</b><br>\nDevelop external facing web applications\n<br>Perform maintenance work / production support to exiting application (BAU)\n<br>Integration of software across multiple platforms and environment.\n<br>Support and troubleshoot technical requirements and complex business / technical issues to achieve the desire outcome.\n<br><b>Essential Skills:</b> Proven experience (minimum 5 years) in developing complex .NET applications with extensive experience in using Visual Studio, ASP.NET MVC, WCF, C#, Angular and Team Foundation Server (TFS). Proven experience in developing mobile responsive web applications that are compliant with WCAG 2.1 AA standards. Experience in detailed technical analysis and implement design solutions to meet end user requirements. Proven ability to deliver results crossing multiple IT disciplines, including requirements identification, technical analysis, code development, code review, and system documentation. Able to maintain product backlog items, bugs and change requests using Microsoft DevOps, prioritise work deliverables to meet the agreed timelines and at a high standard.\n<br><br>\nFor further information please contact Karun Sharma at Clicks IT Recruitment on 02 6202 7744.\n<br><br>\nType\n<br>Contract\n<br><br>\nCategory\n<br>Project / Program / PMO support\n<br><br>\nReference ID\n<br>BBBH65253",
      "id": "p_2ecbe7774a1b14c3",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Full Stack Software Engineer (Symfony / Bootstrap / MySQL)",
      "company": "Opus Recruitment Solutions",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/2afd4b89cde8c4ca35d5f0d1fc752d60",
      "location": "Melbourne VIC",
      "salary": "$70,000 - $90,000 a year",
      "time": "1",
      "rating": null,
      "apply": "https://www.opusrecruitmentsolutions.com/search-jobs/34905047-full-stack-software-engineer-symfony-bootstrap-mysql-job-australia-melbourne?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div>Mid Level Full Stack Software Developer\n<br>\n<ul><li>Permanent Role within an exciting Digital Agency</li><li>\nGreat opportunity for an experienced, passionate individual.</li><li>\nA chance to work with an expanding Developement team through Melbourne.</li></ul>\n<br>\n<b>The company</b>\n<br>\nOur client is a well established, fast growing Digital Agency the delivers solutions to multiple industries. Their attitude is always to bring in the best people in to drive their business forward. They believe in maximising impact through talented developers using the latest in technology. They have an extensive amount of projects coming through and need to on-board as soon as possible to help build an incredible business opportunity.\n<br>\nIf you are successful with this application you will play a pivotal role within the company, joining one of their highly talented development teams as a Mid/Senior Fullstack Developer. You will need to have a passion for creating fantastic products with a keen interest in PHP framework Symfony. This is an exciting opportunity to be part of a small, high performing agile team delivering best outcomes for high-end clients.\n<br>\n<br>\n<b>To be considered, you will need to demonstrate the following:</b><br>\n<br>\n<ul><li>PHP atleast 3-4 years commercial experience.</li><li>\nExperience with Symfony framework working on REST API's</li><li>\n2+ years development experience with Javascript frameworks.</li><li>\nGIT, MySQL and HTML.</li><li>\nAbility to follow best practice coding methodologies.</li></ul>\n<br>\nThe benefits are considerable and the workplace is one you definitely want to be in!\n<br>\nIf this sounds like you or someone you know, get in touch with me ASAP!<br>\n<br>\n<br>\nEmail: jackson.braid@hotmail.com\n<br>\nPhone: 0406 194 116</div>",
      "id": "p_baa32992ec68e4d1",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Front End Developer",
      "company": "Torii",
      "companyLogo": null,
      "location": "Melbourne VIC",
      "salary": null,
      "time": "4",
      "rating": null,
      "apply": "http://toriiconsulting.com.au/jobs/front-end-developer-569/",
      "content": "<div><p>An exciting contract opportunity currently exists for an experienced Front End Developer. In this role, you will join a high performing technical and creative team, contributing to unifying and improving user experience across our client’s products.</p>\n<p>\nKey responsibilities include:</p>\n<ul>\n<li>Completing component based documentation and release notes</li>\n<li>Working closely with developers to source code and create processes allowing developers to contribute code to code library</li>\n<li>Coaching developers on quality of code and providing guidance and direction to other developers</li>\n<li>Work closely with the Senior UI Designer to ensure design and code are aligned</li>\n</ul>\n<p>For this role, demonstrated experience in a Front-End Developer role, with strong UI exposure, is required. With a sound background in software development (Java), you will have previously worked on a code library and interactive web components, with an ability to write accessible and semantic mark ups.</p>\n<p>\nTechnical skills required includes CSS, SASS, React, Angular and StencilJS. Experience with Storybook and a working knowledge of APIs, unit testing and UI/UX design principles is also required.</p>\n<p>\nTo apply, please send your CV through the link provided. Please note, due to a high number of applications, only suitable candidates will be contacted.</p>\n<div><h3 class=\"jobSectionHeader\"><b>\nJob Information</b></h3><div><div>\nJob Reference: <b>BBBH892</b></div><div>\nSalary:\n</div><div>Salary From: <b>$0.00</b></div><div>\nSalary To: <b>$0.00</b></div><div>\nJob Industries: <b>Design and Creative</b></div><div>\nJob Locations: <b>Southbank, Melbourne, Australia</b></div><div>\nJob Types: <b>Contract</b></div></div></div></div><p></p>",
      "id": "p_bdd689e55099aba1",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Talent Street",
      "companyLogo": null,
      "location": "Brisbane QLD",
      "salary": null,
      "time": "8",
      "rating": null,
      "apply": "https://jobs.talentstreet.com.au/apply/32771/indeed",
      "content": "<div><h1 class=\"jobSectionHeader\"><b>Software Developer</b></h1>\n<div>\n<p><b>Overview</b></p>\n<p><b>\nTalent Street is currently looking for Software Developer with proven experience with .NET applications and extensive experience in using Visual Studio, ASP.NET MVC, WCF, C#, Angular and Team Foundation Server (TFS).</b></p>\n<p><b>\nResponsibilities Including:</b></p>\n<ul>\n<li>Develop external facing web applications</li>\n<li>Perform maintenance work / production support to exiting application (BAU)</li>\n<li>Integration of software across multiple platforms and environment in the National Health Sector</li>\n<li>Support and troubleshoot technical requirements and complex business / technical issues to achieve the desire outcome This role will suit someone who is seeking a challenging position that is exposed to a variety of work systems.</li>\n<li>The candidate must have excellent technical knowledge, experience, team focus and ability to adapt to a dynamic environment with shifting priorities. We request that appropriate checks are made to ensure applicants submitted are represented by a single recruitment agency.</li>\n</ul>\n<p><b>Essential criteria</b></p>\n<ul>\n<li>Proven experience in developing mobile responsive web applications that are compliant with WCAG 2.1 AA standards.</li>\n<li>Experience in detailed technical analysis and implement design solutions to meet end user requirements.</li>\n<li>Proven ability to deliver results crossing multiple IT disciplines, including requirements identification, technical analysis, code development, code review, and system documentation.</li>\n<li>Highly effective written and oral communication skills, including a demonstrated ability to influence and negotiate to achieve the desired outcome effectively with stakeholders at all levels.</li>\n<li>Able to maintain product backlog items, bugs and change requests using Microsoft DevOps, priorities work deliverables to meet the agreed timelines and at a high standard.</li>\n</ul>\n<p><b>Desirable criteria</b></p>\n<ul>\n<li>Experience in Agile / Iterative software development methodologies.</li><br>\n</ul><p></p>\n<p>\nPlease contact Felix at 0426 013 565 or email at ffrancis@talentstreet.com.au to know more about this role</p></div></div>",
      "id": "p_2a616c57b1be57e5",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Software Developer",
      "company": "Opus Recruitment Solutions",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/2afd4b89cde8c4ca35d5f0d1fc752d60",
      "location": "Sydney NSW",
      "salary": "$110,000 - $130,000 a year",
      "time": "11",
      "rating": null,
      "apply": "https://www.opusrecruitmentsolutions.com/search-jobs/34904570-senior-software-developer-job-australia-sydney?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed",
      "content": "<div><b>Senior Software Developer</b><br>\n<br>\n<ul><li>Fast growing company where you can develop and grow</li><li>\nImpressive remuneration: up to <b>$130k + Super</b> (dependant on experience)</li><li>\nWork with the latest technology and frameworks to build new platforms</li></ul>\n<br>\nMy client is a highly driven global data analytics company experiencing huge growth. They are looking for a Senior Developer to work alongside the CTO and growing team to build exciting new platforms. They are looking for a passionate and motivated developer who thrives in a highly energetic and passionate environment to join their growing team.<br>\n<br>\n<br>\n<br>\n<b>Responsibilities:</b>\n<br>\n<ul><li>Frontend development using React to build platforms</li><li>\nDevelop web applications using JavaScript, HTML and CSS</li><li>\nBackend development in Python using Flask and Django</li><li>\nIntegrate across a variety of APIs</li><li>\nChallenge and contribute to the clients’ current software design</li></ul>\n<br>\n<b>You Will Have:</b>\n<br>\n<ul><li>Must have strong experience with <b>React</b></li><li>\nHave good experience with Node.js &amp; backend development</li><li>\nStrong attention to detail</li><li>\nPassion, curiosity and the ability to think and work independently</li></ul>\n<br>\n<b>Benefits:</b>\n<br>\n<ul><li>Impressive remuneration: up to <b>$130k</b> <b>+ Super </b>(dependent on experience)</li><li>\nConvenient location – less than 10min walk from Central station</li><li>\nOpportunity for career progression + development</li></ul>\n<br>\nIf you want to join an innovative and exciting company and be rewarded for your hard work then please give me a call or send your CV in <b>word format </b>to me today!\n<br>\n<br>\n02 8289 0121 or Fiona.glover@opusrs.com.au</div>",
      "id": "p_d02231b29ac1b4c9",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Software Developer",
      "company": "Clicks IT Recruitment",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/9cf7aca3c385c5dbc37794db3e069c87",
      "location": "New South Wales",
      "salary": null,
      "time": "4",
      "rating": "5.0",
      "apply": "https://clicks.com.au/jobs/contract-it-jobs/in-nsw-other/bbbh65253-software-developer/",
      "content": "We are looking for Software Developers for a Federal government client in Canberra.\n<br><b>Duration:</b> Till December 2020 with extension.\n<br><b>Security Clearance:</b> NV1 clearance is preferred, candidates with Baseline may be considered.\n<br><br>\n<b>Role and Responsibilities:</b><br>\nDevelop external facing web applications\n<br>Perform maintenance work / production support to exiting application (BAU)\n<br>Integration of software across multiple platforms and environment.\n<br>Support and troubleshoot technical requirements and complex business / technical issues to achieve the desire outcome.\n<br><b>Essential Skills:</b> Proven experience (minimum 5 years) in developing complex .NET applications with extensive experience in using Visual Studio, ASP.NET MVC, WCF, C#, Angular and Team Foundation Server (TFS). Proven experience in developing mobile responsive web applications that are compliant with WCAG 2.1 AA standards. Experience in detailed technical analysis and implement design solutions to meet end user requirements. Proven ability to deliver results crossing multiple IT disciplines, including requirements identification, technical analysis, code development, code review, and system documentation. Able to maintain product backlog items, bugs and change requests using Microsoft DevOps, prioritise work deliverables to meet the agreed timelines and at a high standard.\n<br><br>\nFor further information please contact Karun Sharma at Clicks IT Recruitment on 02 6202 7744.\n<br><br>\nType\n<br>Contract\n<br><br>\nCategory\n<br>Project / Program / PMO support\n<br><br>\nReference ID\n<br>BBBH65253",
      "id": "p_2ecbe7774a1b14c3",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Developer",
      "company": "Empired",
      "companyLogo": null,
      "location": "Perth WA",
      "salary": null,
      "time": "9",
      "rating": "3.8",
      "apply": "https://www.empired.com/Careers/Vacancies/senior-developer-3562585/?source=34577",
      "content": "<div><p>Senior Developer</p>\n<p><b>Perth</b></p>\n<p><b>Empired seeks multiple Senior Developers and Principal Developers. Permanent or contract opportunities. .Net, MVC with Azure, React.</b></p>\n<ul><li>The largest Asia Pacific dedicated Microsoft services provider</li>\n<li>ASX Listed- Be rewarded and share in our success</li>\n<li>Opportunity to learn and work with the industry's brightest leaders</li>\n</ul><div><div><div>We are looking for Senior Developers and Principal Developers to join our successful Digital practice. You would be responsible for providing objective advice, expertise and specialist skills in <b>.Net Development</b>. As a core member of the Digital<b> </b>team, you will be work autonomously and collaboratively to develop world class modern applications. We will help you achieve your goals by continuous professional development and career progression sessions.<br>\n<br>\n<b>About You</b><br>\nYou will need to be a passionate, motivated and client focused <b>Senior .Net Developer / Principal Developer.</b> You will be incredibly ambitious, and as a confident, <b>expert developer in .Net, C#, Azure, React. </b>You will be at ease presenting to a broad audience and enjoy sharing your knowledge with your peers.<br>\n<br>\n<b>Your Experience</b><br>\nYou will have demonstrated solid commercial development experience with an excellent understanding of <b>coding methods</b> and <b>best practices</b>, front-end development skills, .Net, MVC and Azure, React, mobile development and agile methodologies. You will also have gained a strong understanding of Microsoft technologies with the ability to present these and their benefits to existing and potential clients. We have multiple opportunities. Let us know where your technical strengths lie.<br>\n<br>\n<i>Empired is an Australian-owned and headquartered digital services provider with the breadth and depth to enable mid to large sized enterprises to tap into tomorrow’s advantage today.</i><br>\n<br>\n<i>Empired helps organisations across Australasia to transform, thrive and stay relevant as digital businesses in an ever-changing world. Using technology as the enabler, we assist businesses to engage customers, increase efficiency, improve productivity and achieve competitive advantage.</i></div></div></div></div><p></p>",
      "id": "p_cb877c3369647e0e",
      "tags": ["javascript"]
    },
    {
      "jobTitle": ".NET Full Stack Developer",
      "company": "Robert Half",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/f406729f9625622cf74f620acdc97909",
      "location": "Melbourne VIC",
      "salary": "$120,000 a year",
      "time": "3",
      "rating": "3.9",
      "apply": "https://www.roberthalf.com.au/job/melbourne/net-full-stack-developer/06800-0011441087-auen?rh_job-feed=true&source=APPLICANT_SOURCE-6-179",
      "content": "Full Stack .NET Developer | Transformation &amp; Greenfield solutions | Permanent | Based out of their offices in the stunning Byron Bay, NSW.\n<br><br>\nThe Company\n<br><br>\nNationally established Australian founded SaaS company\n<br>In-house technology development &amp; solutions\n<br>Modern Microsoft &amp; Azure driven environment\n<br>Sociable &amp; performance driven business culture\n<br>Located in one of Australia's most desirable towns, Byron Bay NSW\n<br><br>\nThe Role\n<br><br>\nCore platform / end to end full stack solution builds\n<br>Integration solutions &amp; API Development\n<br>Database design and development | SQL Server\n<br>Responsive development\n<br>Gathering requirements | Stakeholder engagement\n<br>Play a critical role in ensuring the successful delivery of quality-crafted solutions\n<br><br>\nYour Skills &amp; Experience\n<br><br>\nDegree in Computer Science, IT, Engineering or related field.\n<br>Proven experience with end to end software &amp; web development projects\n<br>Strong experience in . NET, .NET Core, C#, Angular, &amp; Web Services Development\n<br>Familiar with SQL Server - stored procedures\n<br>Experience with integrating with API backends\n<br>Strong working knowledge of Microsoft Azure\n<br>Customer experience mind-set\n<br>Problem solving skills | Solutions focused\n<br>Clear and effective communication style\n<br>Team player\n<br>Ability to work autonomously and as part of a team-oriented environment\n<br>Unlimited Full-Working Rights in Australia with the ability to relocate to Byron Bay (if you don't already live within the area).\n<br><br>\nAbout you\n<br><br>\nYou have brilliant technical skills and consider yourself an authority on best coding practices and how reliable products should be built. You have the creative flair to deliver innovative solutions and the business insights to know what will work. You are highly collaborative and a true team colleague, and your exceptional communication skills let you convey complex ideas to a non-technical business-users.\n<br><br>\nWhat's on offer?\n<br><br>\nA fast-paced work environment backed by a motivated and energized team of Software professionals.\n<br>A company on a growth path offering extensive opportunities to grow your skill set and career potential.\n<br>The rewards of a role where you will be challenged every single day\n<br>A workplace where work-life balance is actively promoted.\n<br><br>\nRobert Half Ltd is committed to equal opportunity and we value diversity at our company. We do not discriminate on the basis of categories protected under local law.",
      "id": "p_6a436fb57942f419",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Implementation Consultant - ServiceNow",
      "company": "The Business Agility Group",
      "companyLogo": null,
      "location": "Australia",
      "salary": null,
      "time": "12",
      "rating": null,
      "apply": "https://tbagilityau.broadbeantech.com/jobs/view/502/Senior-Implementation-Consultant---ServiceNow.html",
      "content": "<p></p><div><p>Our Client is a specialist Service Management Consultancy who is looking for several Senior ServiceNow Development &amp; Implementation Consultant initially for a 6 month contract to support their recent business growth around Enterprise implementations of ServiceNow.<br>\nLocation in Australia is negotiable and contract is likely to be extended.<br>\nThis role will focus on hands-on development and consultancy to implement the ServiceNow platform, including:</p>\n<ul>\n<li>IT Service Management,</li>\n<li>IT Operations Management,</li>\n<li>Customer Service Management,</li>\n<li>Field Services modules</li>\n<li>Identify business requirements,</li>\n<li>Do requirements management, along with functional design, prototyping, process design (including scenario design, flow mapping), configuration, development, testing and training</li>\n<li>Along with defining support procedures and supporting implementations.</li><br>\n</ul>\n<p><br>\nThe successful candidates will work as a key member of a Scrum team to deliver business outcomes and continuous improvement.<br>\n<b>Key Skills, Experience &amp; Qualifications include:</b></p>\n<ul>\n<li>Preferred Bachelor's Degree in Computer Science, Information Systems or related area OR equivalent relevant experience.</li>\n<li>Familiar with Agile methodology, Test Driven Development and DevOps automation.</li>\n<li>Strong professional and interpersonal skills including, creative problem solving, effective written and verbal communications, planned and organized coordination of cross functional teams, acute attention to detail and quality, and driven with the ability to self-manage.</li>\n<li>Working knowledge with Web technologies (SOAP, JSON, XML, HTML, JavaScript, AJAX, and Web Services)</li>\n<li>Strong understanding of ServiceNow platform and PAAS model with relevance to ServiceNow integration solutions including - SSO, SAML, SSL, Web Services, LDAP, JDBC, ODBC, REST, SCP, SFTP, and MID server.</li>\n<li>Experience with configuration and implementation of ServiceNow ITSM, ITOM (Discovery and Service Mapping in particular) and Customer Service Management.</li>\n<li>Develop and modify ServiceNow schemas, workflows, forms, lists, business rules, UI components, Web services, tables, menus, client scripts, UI Scripts, ACLs, UI Pages and scripted REST APIs.</li>\n<li>Experience with integration with other external modules, platforms and third-party products as well as encryption capabilities.</li>\n<li>Provide configuration and customization including, but not limited to; user interface, workflow administration, reports, data imports, integration, custom scripting and third-party software integrations by applying best practices.</li>\n<li>Experience as a key technical resource for a large scale ServiceNow solutions (Madrid and Orlando versions).</li>\n<li>Create and maintain documentation as necessary for comprehensive business process, operational, security audits, business requirements, technical specifications, and system architects.</li><br>\n</ul>\n<p><br>\n<b>Location:</b> Melbourne, Sydney, Brisbane or Perth (negotiable)<br>\n<b>Remuneration:</b> Daily Rate<br>\n<b>Duration:</b> 6 month contract, with likely extension.<br>\n<b>Start date:</b> May 2020<br>\n<b>For the role:</b></p>\n<ul>\n<li>You must be an AUS resident and have worked locally for at least 2 years;</li>\n<li>Rate will depend on skills and experience; and</li>\n<li>Only shortlisted candidates will be contacted for further discussion.</li><br>\n</ul>\n<p><br>\nIf you think you fit this role, please press <b>Apply Now</b> -&gt;</p></div><p></p>",
      "id": "p_b01c0a17b895e3b2",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Applications Developer",
      "company": "ServiceNow",
      "companyLogo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/da99113efe7d005a1a52d7df81efa840",
      "location": "Sydney NSW",
      "salary": null,
      "time": "12",
      "rating": null,
      "apply": "https://jobs.jobvite.com/careers/servicenow/job/o2Swcfwm?__jvst=Job+Board&__jvsd=Indeed",
      "content": "<div><div><b>Job Title: </b><b>Sr Applications Developer<br>\n</b></div><div></div><div><b>Company\n</b></div><div>Work matters. It’s where we spend a third of our lives. And the workplace of the future is going to be a great place. We’re dedicated to bringing that to life for people everywhere. That’s why we put people at the heart of everything we do.</div><div></div><br>\n<div>\nPeople matter. Our people have a passion for learning, building, and innovating. Whether you’re an engineer, a sales professional, a finance professional, or anything in-between, our roles aim to provide each person with meaningful impact and plenty of space to grow.<br>\n</div><div></div><div><b>Team\n</b></div><p>The charter of the ServiceNow Techops Development team is to develop business applications and customizations on the ServiceNow platform. We develop easy-to-use innovative SaaS solutions for all our internal users and for our customers to interact with us. The team works on multiple complex projects simultaneously using Agile methodologies.<br>\n</p><div></div><div><b>Role\n</b></div><div>The successful candidate will work on JavaScript development across all ServiceNow products - delivering new functionality, implementing the latest features of ServiceNow and customizations as needed. This role requires that you have ability to work in environments requiring an <b>Australian Government Baseline security clearance</b>.</div><div></div><br>\n<div><b>\nWhat you get to do in this role:</b></div><div></div><br>\n<ul><li>\nDesign and develop the best cloud software for businesses using ServiceNow platform.</li><li>\nWork closely with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high quality product to our users.</li><li>\nCollaborate day-to-day with an energetic team of like-minded developers, product managers and quality engineers using agile software development methodology.</li><li>\nMaster new functional areas and take ownership of features that matter to our customers.</li><li>\nDesign features with a core commitment to quality and an eye to how the products will evolve in future releases.</li></ul><div></div><br>\n<div><b>\nIn order to be successful in this role, we need someone who has:</b></div><div></div><br>\n<ul><li><b>\nAustralian Government Baseline security clearance</b> or who is able to obtain Baseline security clearance.</li><li>\nEngineering or masters degree in computer science or equivalent.</li><li>\n7+ years working in a comparable software development role, some of this experience should be as an architect.</li><li>\nExpertise in coding efficient, object-oriented and modularized software.</li><li>\nExperience with Java and object oriented JavaScript.</li><li>\nExperience working with JavaScript libraries such as Angular/React JS, Bootstrap, jQuery, and Prototype.</li><li>\nGood knowledge of AJAX, JSON, XML, SOAP, REST and associated frameworks.</li><li>\nExposure to ServiceNow platform and ML/AI is a big plus.</li><li>\nPassion for software development and problem solving.</li><li>\nDemonstrated aptitude for learning new technologies quickly.</li><li>\nExceptional debugging, testing, and problem solving skills.</li><li>\nStrong written and verbal communication.</li></ul></div><div></div>",
      "id": "p_8b7c375c986a48b5",
      "tags": ["javascript"]
    },
    {
      "jobTitle": "Senior Software Developer",
      "company": "Talent Street",
      "companyLogo": null,
      "location": "Brisbane QLD",
      "salary": null,
      "time": "9",
      "rating": null,
      "apply": "https://jobs.talentstreet.com.au/apply/32770/indeed",
      "content": "<div><p>Talent Street is looking for <b>Senior</b> <b>Software Developer</b> to work with Queensland Government Organisation. Initial Contract till September + 2*3 Months Extension.</p>\n<p><b>\nAbout the Role:</b></p>\n<p>\nQueensland Government organisation is undertaking multi-year transformation project. The project will transition more than one hundred terabytes of geoscience related data and approximately 100,000 reports from 6 systems and physical media into a cloud-based data lake platform. The solution includes a metadata database, data catalogue, graph database, file store, lodgement portal and a range of search tools. 5 systems will be decommissioned as part of the project. The consolidation of 6 systems into one and the automation of data flows requires transformational change for the business stakeholders. The project is being delivered using an agile methodology with a solution development partner and is in the design, build and implementation stage.</p>\n<p><b>\nEssential Skillset:\n</b></p><ul><li>Extensive experience delivering the full SDLC in small agile teams working closely with business stakeholders.</li>\n<li>Proven experience in Full Stack Development</li>\n<li>Demonstrable Full Stack Development capabilities including specific technology -\n<ul><li>Front-end (HTML, CSS, JavaScript and React.js)</li>\n<li>Back-end (.NET Core, REST APIs, Step functions in a PostgreSQL environment)</li>\n<li>Cloud: AWS Lamdas</li>\n</ul></li><li>Good interpersonal and communication skills working with a variety of stakeholders to determine technical requirements, present showcases and troubleshoot.</li>\n</ul>\n<p>Please contact <b>Vaibhav</b> at 0452 225 867 or email at vgusani@talentstreet.com.au to know more about this role</p></div>",
      "id": "p_b99264f757a54a36",
      "tags": ["javascript"]
    }
  ]
}
